Repository: elementary/code
Catalog: po/extra/*.po
Languages: ckb, fr, nl, ro, ru, sk, sv, uk, zh_tw

source: Options to overwrite or cancel are given when switching branch with uncommitted changes
fr: Des options pour écraser ou annuler sont proposées lors du changement de branche avec des modifications non validées
nl: Opties voor het overschrijven of verwijderen worden gegeven bij het wisselen van branch in het geval van niet-opgeslagen wijzigingen
ru: Возможность перезаписать или отменить при переключении ветки с незафиксированными изменениями
sv: Alternativ för att skriva över eller avbryta ges när du byter gren med ändringar som inte arkiverats
uk: Опції перезаписати або скасувати надаються під час перемикання гілки з нефіксованими змінами
zh_tw: 在有未提交的變更時切換分支的時候現在會提供要覆寫還是取消的選項

source: The network can now be accessed from within the Flatpak
fr: Le réseau est désormais accessible à partir du Flatpak
nl: Het netwerk kan nu worden benaderd vanuit de Flatpak
ru: Сеть теперь доступна непосредственно через Flatpak
sv: Nätverket kan nu nås inifrån Flatpak
uk: Тепер доступ до мережі можна отримати безпосередньо з Flatpak
zh_tw: 讓 Flatpak 版也能存取網路

source: The branch names in the "Branch" submenus are now sorted alphabetically
fr: Le nom des branches dans les sous-menus de « Branche » sont désormais triés alphabétiquement
nl: De branchnamen in de "Branch"-submenu's zijn nu alfabetisch geordend
ru: Названия веток в подменю «ветки» теперь сортируются по алфавиту
sv: Grennamnen i undermenyerna "Gren" är nu sorterade i alfabetisk ordning
uk: Назви гілок у підменю «Гілка» тепер відсортовано за абеткою
zh_tw: 在「分支」子選單以分支名稱順序排序分支

source: The extension list now has switches instead of checkboxes in order to provide a larger target
fr: La liste des extensions comporte désormais des boutons d'activation/désactivation au lieu des cases à cocher pour une meilleure ergonomie
nl: De extensielijst heeft nu schakelaars in plaats van selectievakjes om een bredere doel te bieden
ru: В целях увеличения площади для нажатия, список расширений теперь использует переключатели вместо флажков
sv: Tilläggslistan har nu växlar istället för kryssrutor för att ge en större mål
uk: Список розширень тепер має перемикачі замість прапорців, щоб забезпечити більше цілей
zh_tw: 讓擴充元件列表使用切換開關而非勾選方塊，這樣點擊目標比較大

source: The terminal pane now implements smart copy-paste and follows the "natural-copy-paste" setting of Terminal
fr: Le panneau du terminal implémente désormais le copier-coller intelligent et suit le paramètre « copier-coller naturel » de l'application Terminal
nl: Het terminalvenster implementeert nu slim kopiëren en plakken en volgt de "natuurlijke kopieer- en plak"-instellingen van de Terminal
ru: Панель терминала теперь поддерживает умное копирование-вставку, следуя настройке «natural-copy-paste» Терминала
sv: Terminalfönstret implementerar nu smart kopiera-klistra in och följer inställningen "natural-copy-paste" i Terminal
uk: Панель термінала тепер реалізує розумне копіювання-вставлення і дотримується налаштувань «природне копіювання-вставлення» у Терміналі
zh_tw: 新增智慧複製貼上的功能到終端機面板，並讓它跟隨《終端機》應用程式的「自然複製貼上」設定值

source: The Vala symbol pane now gives more information in the tooltips
fr: Le panneau des symboles Vala donne désormais plus d'information sur les infobulles
nl: Het Vala-symboolvenster geeft nu meer informatie in de tooltips
ru: Панель символов Vala теперь показывает больше информации во всплывающих подсказках
sv: Vala-symbolfönstret ger nu mer information i verktygstipsen
uk: Панель символів Vala тепер надає більше інформації у підказках
zh_tw: 讓 Vala 符號面板在工具提示裡提供更多資訊

source: Launcher actions now have icons
fr: Les actions du lanceur ont désormais des icônes
nl: De startesacties hebben nu pictogrammen
ru: Действия файла запуска теперь имеют значки
sv: Åtgärder i startprogrammet har nu ikoner
uk: Дії панелі запуску тепер мають піктограми
zh_tw: 為啟動器動作加上圖示

source: Opening and immediately closing a new document no longer prevents further documents being opened
fr: L'ouverture puis la fermeture immédiate d'un nouveau document n'empêche plus l'ouverture d'autres documents
nl: Het openen en onmiddellijk sluiten van een nieuw document voorkomt niet langer dat andere documenten kunnen worden geopend
ru: Открытие и немедленно закрытие нового документа больше не блокирует открытие последующих документов
sv: Öppning och omedelbar stängning av ett nytt dokument förhindrar inte längre att ytterligare dokument öppnas
uk: Відкриття та негайне закриття нового документа більше не перешкоджає відкриттю інших документів
zh_tw: 修正開啟新文件後馬上關閉它會使應用程式無法開啟更多文件的問題

source: The Vala symbol pane may only block the UI for a limited time if there are a large number of symbols
fr: Le panneau des symboles Vala ne peut bloquer l'interface que pendant un temps limité s'il y a un grand nombre de symboles
nl: Het Vala-symboolvenster kan de gebruiksersinterface slechts voor een korte tijd blokkeren als er veel symbolen zijn
ru: Панель символов Vala блокирует интерфейс на некоторое время, только если символов много
sv: Valas symbolfönster kan blockera användargränssnittet under en begränsad tid om det finns ett stort antal symboler
uk: Панель символів Vala може блокувати інтерфейс лише на обмежений час, якщо є велика кількість символів
zh_tw: 修正 Vala 符號面板在有非常多符號時會擋住介面更新太久的問題

source: The "Open in …" menu is no longer empty when running as Flatpak
fr: Le menu « Ouvrir dans… » n'est plus vide lors de l'exécution en tant que Flatpak
nl: Het menu "Open in ..." is niet langer leeg wanneer het programma als Flatpak wordt uitgevoerd
ru: Меню «Открыть в…» больше не пустое в версии приложения в формате Flatpak
sv: Menyn "Öppna i ..." är inte längre tom när du kör som Flatpak
uk: Меню «Відкрити в ...» більше не порожня під час запуску як Flatpak
zh_tw: 修正 Flatpak 版的「開啟於…」選單是空的的問題

source: The search term now persists until editing or closing the search bar.
fr: La recherche est désormais persistante jusqu'à l'édition ou la fermeture de la barre de recherche.
nl: De zoekterm blijft nu staan tot de zoekbalk wordt aangepast of gesloten.
ru: Поисковый запрос теперь сохраняется до изменения или закрытия поисковой строки.
sv: Sökordet kvarstår nu tills du redigerar eller stänger sökfältet.
uk: Пошуковий термін тепер зберігається до редагування або закриття панелі пошуку.
zh_tw: 讓搜尋字詞只有在編輯搜尋列或關閉搜尋列的時候才會改變或清空。

source: No longer allow the parent or child of an open project to be itself opened as a project
fr: Le parent ou l'enfant d'un projet ouvert ne peut plus être lui-même ouvert en tant que projet
nl: Sta niet langer toe dat van een open project een bovenliggend of onderliggend project zelf als project wordt geopend
ru: Дочерний или родительский элемент открытого проекта больше нельзя открыть как отдельный проект
sv: Tillåter inte längre att ett öppet projekt överliggande projekt eller barn öppnas som ett eget projekt
uk: Більше не дозволяється проєктам вищого рівня або дочірнім відкритих проєктів відкриватися як проєкти
zh_tw: 不再允許將已開啟專案的上層目錄或子目錄本身同時作為專案開啟

source: The active project dropdown now keeps in sync
fr: La liste déroulante du projet actif est désormais synchronisée
nl: Het keuzemenu van het actieve project blijft nu gesynchroniseerd
ru: Выпадающее меню активных проектов теперь корректно синхронизируется
sv: Rullgardinsmenyn för aktivt projekt är nu synkroniserad
uk: Спадне меню активного проєкту тепер синхронізується
zh_tw: 維持作用中專案下拉式選單內容同步

source: Numbered lists are now handled correctly by Markdown plugin
fr: Les listes ordonnées sont désormais correctement gérées par l'extension Markdown
nl: Genummerde lijsten worden nu correct verwerkt door de Markdown-plugin
ru: Упорядоченные списки теперь корректно отображаются плагином Markdown
sv: Numrerade listor hanteras nu korrekt av Markdown-tillägg
uk: Нумеровані списки тепер коректно обробляються плагіном Markdown
zh_tw: 讓 Markdown 外掛程式正確處理編號清單

source: The highlighting plugin now works with selections of more than one word
fr: L'extension de surbrillance fonctionne désormais avec des sélections de plus d'un mot
nl: De makeerplug-in werkt nu met selecties van meer dan één woord
ru: Плагин подсветки теперь работает при выделении более чем одного слова
sv: Tillägg för markering fungerar nu med markeringar av mer än ett ord
uk: Плагін виділення тепер працює з виділенням більш ніж одного слова
zh_tw: 讓標明外掛程式在選取不只一個單詞時也能正常運作

source: The "Open in …" menu is now sorted and includes a "Terminal Pane" entry
fr: Le menu « Ouvrir dans… » est désormais trié et comporte une entrée « Panneau du terminal »
nl: Het "Open in ..."-menu is nu geordend en bevat een "Terminalvenster"-optie
ru: Меню «Открыть в…» теперь отсортировано и включает опцию «Панель терминала»
sv: Menyn "Öppna i ..." är nu sorterad och innehåller en post för "Terminalfönster"
uk: Меню «Відкрити в ...» тепер відсортовано і містить пункт «Термінальна панель»
zh_tw: 排序「開啟於…」選單並在其中包含「終端機面板」項目

source: Folders containing may items now expand faster without blocking the UI
fr: Les dossiers comportant de nombreux éléments sont désormais ouverts plus rapidement sans bloquer l'interface
nl: Mappen met veel items worden nu sneller uitgebouwd zonder de gebruikersinterface te blokkeren
ru: Папки, содержащие много элементов, теперь разворачиваются быстрее и не блокируют интерфейс
sv: Mappar som innehåller många objekt expanderar nu snabbare utan att blockera användargränssnittet
uk: Теки, що містять багато елементів, тепер розгортаються швидше, не блокуючи інтерфейс користувача
zh_tw: 展開內含非常多項目的資料夾時介面不會再被阻擋更新而卡住

source: Symbol Pane now always scrolls document to selected symbol
fr: Le panneau des symboles défile désormais toujours le document jusqu'aux symboles sélectionnés
nl: Het symboolvenster scrollt het document nu altijd naar het geselecteerde symbool
ru: Панель символов теперь прокручивает документ до выбранного символа
sv: Symbolfönstret rullar nu alltid dokumentet till den valda symbolen
uk: Панель символів тепер завжди прокручує документ до вибраного символу
zh_tw: 讓符號面板總是把文件捲動到所選符號

source: Add symbol filter to Outline pane
fr: Ajout d'un filtre de symbole au panneau
nl: Een symboolfilter toevoegen aan het Overzichtsvenster
ru: Добавлена фильтрация символов на страницу структуры
sv: Lägg till symbolfilter i översiktspanel
uk: Додавання фільтра символів на панель Контур
zh_tw: 在大綱面板中加入符號過濾器

source: The Terminal pane now has a settable default directory
fr: Le panneau Terminal dispose désormais d'un dossier par défaut configurable
nl: Het terminalvenster heeft nu een instelbare standaardmap
ru: Панель терминала теперь имеет настраиваемый каталог по умолчанию
sv: Terminalfönstret har nu en inställbar standardkatalog
uk: Панель термінала відтепер має налаштовувану усталену директорію
zh_tw: 終端機面板現在提供設定預設目錄的選項

source: New Tab Bar with improved animations and Drag-n-Drop
fr: Nouvelle barre d'onglets avec animations améliorées et glisser-déposer
nl: Een nieuwe tabbalk met verbeterde animaties en slepen-en-neerzetten
ru: Новая панель вкладок с улучшенными анимациями и перетаскиванием
sv: Nytt flikfält med förbättrade animationer och dra-och-släpp
uk: Нова панель вкладок з покращеною анімацією та перетягуванням
zh_tw: 新分頁列，提供改善的動畫與拖放

source: When opening a file in Code from the commandline or another app, a line/char position or selection range may be specified
fr: Lors de l'ouverture d'un fichier dans Code depuis la ligne de commande ou une autre application, une position de ligne/caractère ou une plage de sélection peut être spécifiée
nl: Bij het openen van een bestand in Code vanuit de opdrachtregel of een andere app kan een regel/karakterpositie of een selectiebereik worden opgegeven
ru: При открытии файла в Коде из Терминала или другого приложения теперь может быть указано выделение
sv: När du öppnar en fil i Kod från kommandoraden eller ett annat program kan du ange en rad/teckensnitts-position eller ett urvalsområde
uk: Під час відкриття файлу в Код з командного рядка або іншого застосунку можна вказати позицію рядка/символу або діапазон виділення
zh_tw: 從指令列或另一個應用程式讓 Code 開啟檔案時，現在能夠指定行數/欄位位置或選取範圍

source: Add a fuzzy-find plugin which finds files in all open projects
fr: Ajout d'une extension de recherche fuzzy qui trouve des fichiers dans tous les projets ouverts
nl: Voeg een fuzzy-find plug-in toe die bestanden in alle open projecten vindt
ru: Добавьте плагин нечеткого поиска, который находит файлы во всех открытых проектах
sv: Lägg till ett tillägg för fuzzy-find som hittar filer i alla öppna projekt
uk: Додано плагін неточного пошуку, який шукає файли у всіх відкритих проєктах
zh_tw: 新增模糊搜尋插件，它能夠在所有已開啟專案中尋找檔案

source: Save and restore the state of the terminal pane
fr: Sauvegarde et restauration de l'état du panneau de terminal
nl: Bewaar of herstel de status van het terminalvenster
ru: Сохранение и восстановление панели терминала
sv: Spara och återställ tillståndet för terminalfönstret
uk: Збереження й відновлення стану в панелі термінала
zh_tw: 儲存或復原終端機面板狀態

source: "Find in Folder" now works for all folders and text files, not only ".vala" files
fr: « Rechercher dans le dossier » fonctionne désormais pour tous les dossiers et fichiers texte, pas seulement les fichiers « .vala »
nl: "Zoeken in map" werkt nu voor alle mappen en tekstbestanden, niet alleen voor ".vala"-bestanden
ru: Поиск в папке теперь работает для всех папок и текстовых фалов, а не только для файлов «.vala»
sv: "Hitta i mapp" fungerar nu för alla mappar och textfiler, inte bara ".vala"-filer
uk: "Знайти в теці" відтепер працює для всіх тек і текстових файлів, а не тільки для файлів ".vala"
zh_tw: 「在資料夾中尋找」現在支援所有資料夾和文字檔案，不只有 ".vala" 檔案

source: "Follow System Style" is now fully respected
fr: « Suivre le thème du système » est désormais respecté
nl: "Volg systeemstijl" wordt nu volledig gerespecteerd
ru: Улучшено следование тёмному стилю системы
sv: "Följ systemstil" är nu fullt ut respekterat
uk: "Дотримуватись стилю системи" відтепер повністю дотримано
zh_tw: 修正沒有完全遵循「跟隨系統風格」設定值的問題

source: The "--new-tab" commandline option now works
fr: L'option en ligne de commande « --new-tab » fonctionne désormais
nl: De "--new-tab" opdrachtregeloptie werkt nu
ru: Параметр командной строки «--new-tab» теперь работает
sv: Kommandoradsflaggan "--new-tab" fungerar nu
uk: Опція командного рядка "--new-tab" тепер працює
zh_tw: "--new-tab" 指令列選項現在能用了

source: The symbol pane width is now synchronised and saved
fr: La largeur du panneau des symboles est désormais synchronisée et sauvegardée
nl: De breedte van het symboolvenster is nu gesynchroniseerd en opgeslagen
ru: Ширина панели символов теперь синхронизируется и сохраняется
sv: Symbolfönstrets bredd synkroniseras och sparas nu
uk: Ширину панелі символів синхронізовано та збережено
zh_tw: 同步並儲存符號面板的寬度

source: Project folders are automatically closed if they are externally renamed, moved or deleted
fr: Les dossiers de projet sont automatiquement fermés s'ils sont renommés, déplacés ou supprimés en dehors de l'application
nl: Projectmappen worden automatisch gesloten als ze extern worden hernoemd, verplaatst of verwijderd
ru: Папки проектов теперь автоматически закрываются, если они переименованы, перемещены или удалены извне
sv: Projektmappar stängs automatiskt om de byter namn, flyttas eller raderas externt
uk: Теки проєктів автоматично закриваються, якщо їх перейменовано, переміщено або видалено ззовні
zh_tw: 專案資料夾在外部被重新命名、移動或刪除時自動將其關閉

source: Fixed temporary backup files persisting under some circumstances
fr: Correction des fichiers de sauvegarde temporaires persistant dans certaines circonstances
nl: Probleem opgelost van tijdelijke back-upbestanden die onder bepaalde omstandigheden blijven bestaan
ru: Исправлены временные файлы резервных копий, сохраняющиеся при некоторых обстоятельствах
sv: Fixade temporära säkerhetskopieringsfiler som kvarstod under vissa omständigheter
uk: Виправлено збереження тимчасових файлів резервних копій за певних обставин
zh_tw: 修正暫存備份檔在某些情況下會留下來的問題

source: The Show-Replace action has been improved
fr: L'action « Afficher-Remplacer » a été améliorée
nl: De Toon-Vervang actie is verbeterd
ru: Улучшено действие «Поиск и замена»
sv: Åtgärden Visa-ersätt har förbättrats
uk: Покращено дію Показати-замінити
zh_tw: 改善 Show-Replace 動作

source: Search options transferred to searchbar menu
fr: Les options de recherche ont été transférées dans le menu de la barre de recherche
nl: Zoekopties verplaats naar het zoekbalkmenu
ru: Параметры поиска были перенесены в меню строки поиска
sv: Sökalternativ flyttade till menyn i sökfältet
uk: Опції пошуку перенесено до меню панелі пошуку
zh_tw: 將搜尋選項移到搜尋列選單

source: Whole word search option added
fr: Ajout d'une option de recherche de mots entiers
nl: Hele woord zoekopties toegevoegd
ru: Добавлен поиск по целому слову
sv: Sökalternativ för hela ord har lagts till
uk: Додано опцію пошуку цілого слова
zh_tw: 新增搜尋整個單詞的選項

source: Whole word, case sensitive mode and use regex search settings now persist
fr: Les paramètres de recherche de mots entiers, de mode sensible à la casse et d'utilisation d'expressions rationnelles persistent désormais
nl: Instellingen voor zoeken op heel woord, hoofdlettergevoeligheid en het gebruik van regex blijven nu behouden
ru: Состояния режимов поиска полных слов, с учётом регистра и с использованием regex теперь сохраняются
sv: Inställningarna för hela ord, läge för skiftlägeskänslighet och användning av regex-sökning kvarstår nu
uk: Налаштування пошуку за цілим словом, із врахуванням регістру та за допомогою регулярних виразів тепер зберігаються
zh_tw: 現在會記住完整單詞、區分大小寫、以及是否使用正則表達式的選項

source: The search bar now updates properly after changing the active document
fr: La barre de recherche se met désormais à jour correctement après avoir changé de document actif
nl: De zoekbalk wordt nu correct bijgewerkt na het veranderen van het actieve document
ru: Панель поиска теперь корректно обновляется после изменения активного документа
sv: Sökfältet uppdateras nu korrekt efter att det aktiva dokumentet har ändrats
uk: Панель пошуку відтепер оновлюється належним чином після зміни активного документа
zh_tw: 搜尋列現在在變更作用中文件後會正確更新

source: Trying to save a document to an unwritable location is now handled better
fr: La tentative d'enregistrement d'un document à un emplacement non inscriptible est désormais mieux gérée
nl: Een document proberen op te slaan naar locatie waartoe niet geschreven mag worden, wordt nu beter afgehandeld
ru: Улучшена обработка попытки сохранить документ в недоступном для записи месте
sv: Försök att spara ett dokument på en plats som inte går att skriva på hanteras nu bättre
uk: Спроба зберегти документ у місці, недоступному для запису, тепер обробляється краще
zh_tw: 改善嘗試將文件儲存到不可寫入的位置時的處理方式

source: The system style is now followed by the symbol outline and when launched without open documents
fr: Le thème du système est maintenant respecté par le détecteur de symboles, ainsi que lors du lancement sans documents ouverts
nl: De systeemstijl wordt nu gevolgd door het systeemoverzicht en wanneer deze geopend zonder open documenten
ru: За системным стилем теперь следуют выделение символов и запуск без открытых документов
sv: Systemstilen följs nu av symbolöversikten och när den startas utan öppna dokument
uk: За стилем системи відтепер слідує контур символів, а також під час запуску без відкритих документів
zh_tw: 在符號大綱中，以及在剛啟動且未開啟任何文件時遵循系統風格

source: Mixed case sensitive search now works as expected
fr: La recherche sensible à la casse fonctionne désormais comme attendu
nl: Zoeken met gemengde hoofd- en kleine letters werkt nu zoals verwacht
ru: Смешанный поиск с учётом регистра теперь работает должным образом
sv: Sökningar med skiftlägeskänslighet fungerar nu som förväntat
uk: Пошук з урахуванням змішаного регістру відтепер працює належним чином
zh_tw: 混合大小寫的搜尋現在會正常運作

source: The search results no longer change unexpectedly when focusing a document
fr: Les résultats de la recherche ne changent plus inopinément lors de la focalisation sur un document
nl: De zoekresultaten veranderen nu niet meer onverwachts als een document wordt geselecteerd
ru: Результаты поиска больше не изменяются при фокусировке на документе
sv: Sökresultaten ändras inte längre oväntat när man fokuserar på ett dokument
uk: Результати пошуку більше не змінюються несподівано при фокусуванні на документі
zh_tw: 聚焦文件時搜尋結果不再會突然跑掉

source: Now there is always an active project at startup if there are projects in the sidebar
fr: Désormais, il y a toujours un projet actif au démarrage lorsqu'il y a des projets dans la barre latérale
nl: Nu is er altijd een actief project bij het opstarten als er projecten in de zijbalk staan
ru: Теперь при запуске всегда есть активный проект, если есть проекты на боковой панели
sv: Nu finns det alltid ett aktivt projekt vid uppstart om det finns projekt i sidofältet
uk: Відтепер під час запуску завжди є активний проєкт, якщо в бічній панелі є проєкти
zh_tw: 現在只要側邊欄中有專案，啟動時就一定會有作用中專案

source: If a development branch is running this shows in the window title and in the dock tooltip
fr: Si une branche de développement est en cours d'exécution, cela apparaît dans le titre de la fenêtre et dans l'infobulle du dock
nl: Als een ontwikkelbranch actief is, wordt dat weergegeven in de venstertitel en in de tooltip van het dock
ru: Если запущена версия в разработке, об этом сообщается в заголовке окна и подсказке в доке
sv: Om en utvecklingsgren körs visas detta i fönstrets titel och i dockans verktygstips
uk: Якщо запущено гілку розробки, це показується у заголовку вікна та у спливній підказці доку
zh_tw: 執行開發版分支時在視窗標題與 Dock 工具提示中顯示

source: Ctrl+PageUp and Ctrl+PageDown shortcuts now switch tabs
fr: Les raccourcis Ctrl+PageHaut et Ctrl+PageBas permettent désormais de changer d'onglet
nl: De sneltoetsen Ctrl+PageUp en Ctrl+PageDown schakelen tussen tabbladen
ru: Сочетания клавиш Ctrl+PageUp и Ctrl+PageDown теперь переключают вкладки
sv: Genvägarna Ctrl+PageUp och Ctrl+PageDown växlar nu flikar
uk: Комбінації клавіш Ctrl+PageUp та Ctrl+PageDown відтепер перемикають вкладки
zh_tw: Ctrl+PageUp 和 Ctrl+PageDown 快捷鍵現在會切換分頁

source: Ensure active project at startup (include non-git folders)
fr: Nous nous sommes assurés qu'il y ait un projet actif au lancement (y compris pour les dossiers qui ne sont pas des dépôts git)
nl: Zorg ervoor dat het project actief is tijdens het opstarten (inclusief niet-git mappen)
ru: Гарантировать активный проект при запуске (включая не-git папки)
sv: Säkerställ aktivt projekt vid uppstart (inkludera icke-git-mappar)
uk: Забезпечення активності проєкту під час запуску (включно з теками, не з git)
zh_tw: 啟動時確保有作用中專案（包含非由 git 管理的資料夾）

source: Redesigned app icon
fr: Nouvelle icône de l'application
nl: Herontworpen app pictogram
ru: Переработана иконка приложения
sv: Omdesignad app-ikon
uk: Оновлений дизайн піктограми застосунку
zh_tw: 重新設計過的應用程式圖示

source: New custom dark and light elementary styles for the source view
fr: Nouveaux thèmes sombre et clair personnalisés d'elementary pour la vue du code source
nl: Nieuw aangepaste donkere en lichte elementary stijlen voor de bronweergave
ru: Новый тёмный и светлый стиль elementary для кода
sv: Nya anpassade mörka och ljusa elementary-stilar för källvyn
uk: Нові користувацькі темні та світлі стилі elementary для перегляду коду
zh_tw: 在原始碼檢視中提供新的自訂 elementary 深色與淺色風格

source: Ability to half tile on small notebook displays
fr: Possibilité d'utiliser la moitié de l'écran sur les petits écrans d'ordinateurs portables
nl: De mogelijkheid om kleine notebookschermen in tweeën te splitsen
ru: Возможность развернуть окно на половину экрана на маленьких экранах
sv: Möjlighet till halvfönster på små bärbara skärmar
uk: Можливість розділення плитки навпіл на невеликих дисплеях ноутбуків
zh_tw: 修正在不夠大的筆電螢幕上無法鋪排視窗的問題
