Repository: elementary/code
Catalog: po/extra/*.po
Languages: ckb, fr, nl, ro, ru, sk, sv, uk, zh_tw

source: Line duplication is now actioned correctly if there is no selection present
ckb: بە دووکردنی دێڕ ئێستا بە دروستی کارپێکراوە ئەگەر هیچ دیاریکردنێک بوونی نەبێت
fr: La duplication des lignes est maintenant effectuée correctement si aucune sélection n'est présente
nl: Regel-duplicatie wordt nu correct uitgevoerd als er geen selectie aanwezig is
ru: Дублирование строки без выделения теперь выполняется правильно
sk: Duplikácia riadkov je vykonávaná správne, ak nie je nič vybrané
sv: Radduplicering utförs nu korrekt om det inte finns något val
uk: Дублювання рядка тепер працює правильно, якщо нічого не вибрано
zh_tw: 現在即使沒有選擇行，重製行數的功能也能正確執行

source: Code no longer crashes when asked to open an unknown URI format
ckb: ئەپەکە لەکار ناکەوێت ئەگەر داوای لێ بکرێت فۆڕماتێکی نەزانرای URI بکاتەوە
fr: Code ne plante plus lorsqu'il est demandé d'ouvrir un format d'URI inconnu
nl: Code crasht niet langer wanneer gevraagd wordt een onbekend URI-formaat te openen
ru: Код больше не вылетает при открытии неизвестного URI формата
sk: Kód už nepadá, keď je požiadaný o otvorenie neznámeho URI formátu
sv: Kod kraschar inte längre när den ombeds öppna ett okänt URI-format
uk: Усунуто збої Коду під час запиту відкриття URI невідомого формату
zh_tw: 修正開啟未知的 URI 格式時會崩潰的問題

source: Projects with the same name now include their parent folder name as well
ckb: ئێستا ئەو پڕۆژانەی کە هەمان ناویان هەیە، ناوی باوانیشیان پشان دەدرێت
sk: Projekty s rovnakým názvom odteraz zahŕňajú aj názov svojho nadradeného priečinku

source: When scrolling to search results, overshoot slightly for better visibility
ckb: کاتێك سكڕۆڵ دەکەیت بۆ ئەنجامەکانی گەڕان، کەمێك زیاتر بڕۆ خوارەوە بۆ بینینێکی باشتر
sk: Zlepšená viditeľnosť pri posúvaní k výsledkom vyhľadávania

source: Use the FileChooser portal instead of the one from GTK
ckb: بەکارهێنانی دەرچەی FileChooser لە جێگەی دانەکەی GTK
sk: Použiť portál FileChooser namiesto toho z GTK

source: Center the global search dialog over the main Code window
ckb: دایەلۆگی گەڕانی گشتی خراوەتە ناوەڕاست، بەسەر پەنجەرەی سەرەکی کۆددا
sk: Dialóg globálneho vyhľadávania je teraz zarovnaný na stred hlavného okna Kódu

source: Fix visibility of Terminal button on Welcome page
ckb: چارەسەرکردنی دەرکەوتنی دوگمەی تێرمیناڵ لە پەنجەرەی بەخێرهاتندا
sk: Opravená viditeľnosť tlačidla Terminálu na uvítacej stránke

source: Fix some keyboard shortcuts affecting unfocused Document instead of focused Terminal
ckb: چاککردنی هەندێک کورتەڕێی تەختەکلیل کە کاردەکاتە سەر ئەو دۆکیومێنتەی کە سەرنجی نەخراوەتەوە سەر بەجێگەی تێرمیناڵی سەرنج دراو
sk: Opravené niektoré klávesové skratky týkajúce sa nezameraného dokumentu namiesto zameraného Terminálu

source: Close Terminal if shell exited and create new Terminal if re-opened with no shell
ckb: داخستنی تێرمیناڵ ئەگەر شێڵ بوونی هەبوو و دروستکردنی تێرمیناڵێکی نوێ ئەگەر دوبارە بەبێ شێڵ کرایەوە
sk: Zatvoriť Terminál po skončení aktivity shellu a otvoriť nový Terminál ak bol znovu otvorený bez shellu

source: "Visible whitespace" combobox is now a switch
ckb: کۆمبۆبۆکسی "بۆشایی سپی دیار" ئێستا بووە بە سویچ
sk: Kombinovaná ponuka „Viditeľné prázdne znaky“ je teraz prepínač

source: Fix crash when creating new window from tab drop
ckb: چارەسەرکردنی تێکچوون کاتێک پەنجەرەیەکی نوێ لە تاب درۆپەوە دەکەیەوە
sk: Opravený pád pri vytváraní nového okna z rozbaľovacej ponuky karty

source: Ensure files created from the sidebar are automatically opened
ckb: دڵنیابوونەوە لە بوونەوەی خۆکارانەی ئەو پەڕگانەی کە لە سایدباڕدا دروست دەکرێن
sk: Zaistené, že súbory vytvorené z bočného panelu sa automaticky otvoria

source: Hide project chooser button when hiding sidebar
ckb: شاردنەوەی دوگمەی هەڵبژێرەری پڕۆژە کاتێک سایدباڕ دەشارییەوە
sk: Skryť tlačidlo výberu projektu pri skrytí bočného panelu

source: Ensure all copy is translatable
ckb: دڵنیابوونەوە لەوەی کە هەموو لەبەرگیراوەکان وەردەگێڕدرێن
sk: Zaistené, že všetky kópie sú prekladateľné

source: New features:
ckb: تایبەتمەندییە تازەکان:
sk: Nové funkcie:

source: New Markdown plugin for WYSIWYG-like editing.
ckb: پێوەکراوی نوێی مارک داون بۆ دەستکاریکردنی وەک WYSIWYG.
sk: Nový zásuvný modul Markdown pre úpravy podobné WYSIWYG.

source: Switch Git branches or create new ones in project folder context menus
ckb: گۆڕین یان دروستکردنی بڕانچی نوێی گیت لە لیستی دەقی بوخچەی پڕۆژە
sk: Prepínajte Git vetvy alebo vytvárajte nové v kontextových menu priečinkov projektu

source: Show Git diff status in source view gutters
ckb: پشاندانی دۆخی گیت دیف
sk: Zobrazujte Git diff status v okrajoch zdrojového zobrazenia

source: Full text search within project folder.
ckb: گەڕانی دەقی تەواو لە بوخچەی پڕۆژەدا.
sk: Úplné textové vyhľadávanie v priečinku projektu

source: Save and restore cursor position between sessions
ckb: پاشەکەوتکردن و هێنانەوەی نیشاندەری دەق لە نێوان سێشنەکاندا
sk: Uložte a obnovte polohu kurzora medzi rôznymi reláciami

source: Close files from a project when that project is closed
ckb: داخستنی پەڕگەکانی پڕۆژەیەک کاتێک پڕۆژەکە دادەخەیت
sk: Zatvárajte súbory z projektu pri zatvorení daného projektu

source: Show full file path in tab tooltips
ckb: پشاندانی شوێنی تەواوی پەڕگە لە توڵتیپسی تابدا
sk: Zobrazte úplnú cestu súboru v popisoch kariet

source: Clear lines with Ctrl + K
ckb: پاککردەوەی دێڕەکان بە کۆنتڕۆڵ و K
sk: Vymazávajte riadky pomocou Ctrl + K

source: Allow Spell Checker extension in Markdown files
ckb: ڕێگەدان بە کارکردنی پێوەکراوی هەڵەچنین لە پەڕگە مارکداونەکاندا
sk: Povoliť rozšírenie Kontrola pravopisu v súboroch Markdown

source: Improve multi-line duplication
ckb: گەشەدان بە بەدووکردنی جوت هێڵ
sk: Vylepšená duplikácia viacerých riadkov naraz

source: Remember whether the sidebar is open
ckb: بیریبێت کە سایدباڕ کراوەیە
sk: Pamätať si, či je bočný panel otvorený

source: Set window title to the focused file
ckb: گۆڕینی تایتڵی پەنجەرە بۆ فایلی کارا و سەرنج دراو
sk: Nastavovať názov okna ako práve vybraný súbor

source: Add keyboard shortcuts for next and previous documents
ckb: زیادکردنی کورتەڕێی تەختەکلیل بۆ دۆکیومێنتەکانی دواتر و پێشتر
sk: Pridané klávesové skratky pre nasledujúce a predchádzajúce dokumenty

source: Show full document path in tab tooltip
ckb: پشاندانی شوێنی تەواوی دۆکیومێنت لە توڵتیپی تابدا
sk: Zobraziť úplnú cestu k dokumentu v popise karty

source: Update Pastebin plugin
ckb: نوێکردنەوەی پێوەکراوی پەیست بین (Pastebin)
sk: Aktualizovaný doplnok Pastebin

source: Correctly indent last line when using the preserve whitespace plugin
ckb: زیادکردنی بۆشایی سەرەتای دێڕ بۆ کۆتا دێڕ بەشێوەیەکی دروست کاتێک پێوەکراوی بۆشایی سپی بەکار دەهێنیت
sk: Správne odsadzovať posledný riadok pri použití doplnku Zachovať mezdery

source: Keep syntax highlighting when duplicating a file
ckb: هێشتنەوەی هایلایتکردنی سینتاکسلە کاتی بەدووکردنی پەڕگەیەک
sk: Zachovať zvýrazňovanie syntaxe pri duplikovaní súboru

source: Expand a collapsed folder if you attempt to open it twice
ckb: کردنەوەی بوخچەیەکی کۆکراوە ئەگەر هەوڵ بدەیت دوو جار بیکەیتەوە
sk: Rozbaliť zatvorený priečinok, ak sa ho pokúsite otvoriť dvakrát

source: Fix an issue where searches are lost when Code loses focus
ckb: چارەسەرکردنی کێشەیەک کە گەڕانەکان بزر دەبون کاتێک سەرنج لەسەر پەنجەری کۆد نە دەما
sk: Opravený problém straty vyhľadávaných výrazov pri prepnutí z okna Kód na iné okno

source: Start Vim plugin in command mode
ckb: دەستپێکردنی پێوەکراوی ڤیم (Vim) لە دۆخی فەرماندا
sk: Spúšťať doplnok Vim v príkazovom režime

source: Fix and add new Vim commands
ckb: چاککردن و زیادکردنی فەرمانی نوێی ڤیم (Vim)
sk: Opravené a pridané nové Vim príkazy

source: Show project folders with a hidden root folder
ckb: پشاندانی بوخچەکانی پڕۆژە لە بوخچەی ڕوتی شاراوەدا
sk: Zobrazovať projektové súbory so skrytým priečinkom root

source: Allow launching with pkexec and disallow launching with sudo
ckb: ڕێگەدان بە کردنەوە لەگەڵ pkexec و ڕێگە نەدان بە کردنەوە لەگەڵ sudo
sk: Povolené spúšťanie s pkexec a zakázané spúšťanie so sudo

source: Remove split view
ckb: رەشکردنی دیمەنی جیاکردنەوە
sk: Odstránené rozdelené zobrazenie

source: Remove browser preview
ckb: رەشکردنەوەی پێشبینینی وێبگەڕ
sk: Odstránená ukážka v prehliadači

source: Fix empty sidebar layout, ensuring folders can always be added
ckb: چاککردنی لەیئاوتی سایدباڕی بەتاڵ، دڵنیابوونەوە لەوەی کە هەمیشە بوخچەکان زیاد دەبن
sk: Opravené prázdne rozloženie bočného panelu, čo zaistí, že priečinky je možné vždy pridať

source: Scroll past the end of a file
ckb: سکڕۆڵ کردن بۆ کۆتایی پەڕگەیەک
sk: Umožnené posúvanie až za koniec súboru

source: More efficiently save and restore window position
ckb: پاشەکەوتکردن و گەڕاندنەوەی شوێنی پەنجەرەیەک بە شێوەیەکی باشتر
sk: Efektívnejšie ukladanie a obnovovanie polohy okna

source: Include Git status in file tooltips
ckb: تێخزاندنی دۆخی گیت لە توڵتیپسی پەڕگە
sk: Zahrnúť stav Git do popisu súborov

source: Option for explicit case-sensitive Find
ckb: بژاردە بۆ دۆزینەوەی هەستیاری کەیسی ڕوون
sk: Možnosť explicitného vyhľadávania s rozlišovaním veľkých a malých písmen

source: Other updates:
ckb: نوێکردنەوەکانی تر:
sk: Ďalšie aktualizácie:

source: Correctly show Toggle Comment menu item when no text is selected
ckb: بە دروستی پیشاندانی لیستی تۆگڵ کۆمێنت کاتێک هیچ دەقێک دیاری نەکراوە
sk: Ak nie je vybraný žiadny text, správne zobraziť položku ponuky Prepnúť komentár

source: Fixed font switch alignment
ckb: چاککردنی لاگرتنی گۆڕینی فۆنت
sk: Opravené zarovnanie prepínača typu písma

source: New "Close Other Folders" menu item to help clean up your sidebar
ckb: دانەیەکی تر بۆ لیستەکە زیادکراوە بە ناوی "داخستنی بوخچەکانی تر" بۆ ئاسانکاری لە پاککردنەوەی سایدباڕەکەتدا
sk: Nová položka ponuky „Zatvoriť ďalšie priečinky“, ktorá vám pomôže vyčistiť bočný panel

source: Save and restore cyclic search setting
ckb: پاشەکەوتکردن و گەڕاندنەوەی ڕێکخستنی گەڕانی بازنەیی
sk: Ukladanie a obnovovanie nastavenia cyklického vyhľadávania

source: Add keyboard shortcuts to menu items
ckb: زیادکردنی کورتەڕێ بۆ دانەکانی لیست
sk: Pridané klávesové skratky k položkám ponuky

source: Make sidebar folder items not selectable
ckb: وا لێکردنی دانەکانی بوخچەی سایدباڕ دیاری نەکرێن
sk: Možnosť zrušiť označovanie priečinkov v bočnom paneli

source: Center new windows
ckb: سەنتەرکردنی پەنجەرە تازەکان
sk: Zarovnávať nové okná na stred

source: Visually deprioritize .gitignored files in project sidebar
ckb: بە شێوەیەکی بینراو پەڕگە .gitignoredەکان پاشبخە لە سایدباڕی پرۆژە
sk: Vizuálne znížená priorita súborov .gitignore v bočnom paneli projektu

source: Smart cut/copy lines with no active selection
ckb: کۆپی/کەتی زیرەک بەبێ دیارکردنی چالاک
sk: Inteligentné vystrihovanie/kopírovanie riadkov bez aktívneho výberu

source: Add a confirmation dialog to the "Restore" action
ckb: زیادکردنی دایەلۆگی دڵنیابوونەوە بۆ کرداری "گەڕاندنەوە"
sk: Pridaný potvrdzovací dialóg do akcie „Obnoviť“

source: Add "Open In" menu to the top-level folder in the folder manager
ckb: زیادکردنی لیستی "کردنەوە لە" بۆ ئاستی بەرزی بوخچە لە بەڕێوەبەری بوخچەدا
sk: Pridaná ponuka „Otvoriť v“ do priečinka najvyššej úrovne v správcovi priečinkov

source: Don't show temporary files in the folder manager
ckb: پەڕگە کاتییەکان پشان مەدە لە بەڕێوەبەری بوخچەدا
sk: Nezobrazovať dočasné súbory v správcovi súborov

source: Add brackets completion and auto-indent by default
ckb: کاراکردنی تەواوکردنی کەوانە و زیادکردنی بۆشایی سەرەتای دێر بە شێوەیەکی خۆکارانە بە شێوەیەکی سەرەکی
sk: Pridaná predvolene zapnutá funkcia doplňovania zátvoriek a automatického odsadzovania

source: Zoom terminal plugin with keyboard
ckb: زومکردنی پێوەکراوی تێرمیناڵ بە تەختەکلیل
sk: Približovanie a oddiaľovanie pomocou klávesnice v zásuvnom module terminálu

source: Honor global privacy setting when saving and restoring
ckb: ڕێزگرتن لە ڕێکخستنەکانی تایبەتمەندی جیهانی لەکاتی پاشەکەوتکردن و گەڕاندنەوە
sk: Rešpektovať globálne nastavenie ochrany súkromia pri ukladaní a obnovovaní

source: Simplify "Draw spaces" preference
ckb: سادەکردنی ڕێکخستنی "Draw spaces"
sk: Zjednodušenie predvoľby „Vykresľovať medzery“

source: Fix the keyboard shortcut for going backwards in search results
ckb: چارەسەکردنی کورتەڕێی تەختەکلیل بۆ گەڕانەوە بۆ دواوە لە ئەنجامەکانی گەڕاندا
sk: Opravená klávesová skratka pre posun späť vo výsledkoch vyhľadávania

source: Fix opening files from relative paths in Terminal
ckb: چاککردنی کردنەوەی پەڕگەکان لە شوێنەکانیانەوە لە تێرمیناڵەوە
sk: Opravené otváranie súborov z relatívnych popisov umiestnenia v Terminále

source: Fix null file dialog when opening a new window via the dock
ckb: چاککردنی دایەلۆگی پەڕگەی نەڵ لە کاتی کردنەوەی پەنجەرەیەکی تازە لە دۆکەوە
sk: Opravený prázdny dialóg súboru pri otváraní nového okna z doku

source: Add "=" as a zoom key
ckb: زیادکردنی "=" وەکو کلیلی زووم کردن
sk: Pridané „=“ ako kláves pre priblíženie

source: Change search entry icon when results aren't found
ckb: گۆڕینی ئایکۆنی سێرچ کاتێک ئەنجامەکان نەدۆزرانەوە
sk: Zmeniť ikonu políčka vyhľadávania, keď nie sú nájdené výsledky

source: Enter name of new file before creating it
ckb: نووسینی ناوی پەڕگە پێش دروستکردنی
sk: Zadanie názvu nového súboru pred jeho vytvorením

source: Use Granite.MessageDialog throughout
ckb: بەکارهێنانی Granite.MessageDialog
sk: Všade používať Granite.MessageDialog

source: Include non-text files in sidebar
ckb: تێخزاندنی پەڕگە نادەقییەکان لە سایدباڕدا
sk: Zahrnúť súbory s iným ako textovým obsahom v bočnom paneli

source: Fix Remove Current View
ckb: چارەکردنی ڕەشکردنەوەی دیمەنی ئێسا
sk: Opravené odstraňovanie aktuálneho zobrazenia

source: Fix New Window desktop action behavior
ckb: چاککردنی ڕەفتاری کرداری ڕوومێزی پەنجەرەی تازە
sk: Opravené správanie akcie pracovnej plochy Nové okno

source: Properly synchronize Ctrl+N key presses with number of new documents spawned
ckb: هاوکاتکردنی داگرتنی‏ کلیلی Ctrl+N لەگەڵ ژمارە دۆکیومێنتە تازەکان
sk: Správna synchronizácia stlačení Ctrl+N s počtom novo vytvorených dokumentov

source: Build system fix for editorconfig dependency
ckb: دروستکردنی چارەکردنی سیستەم بۆ پێبەندی editorconfig
sk: Oprava systému zostavovania pre závislosť editorconfig

source: Add Change Branch context menu item
ckb: زیادکردنی دانەی گۆڕینی بڕانچ بۆ لیست
sk: Pridaná položka kontextového menu Zmeniť vetvu

source: Avoid possible startup crash related to how plugins load
ckb: خۆپارێزی لە تێکچوونەکانی دەستپێک کە پەیوەندی بە چۆنیەتی لۆد کردنی پێوەکراوەکانەوە هەبوو
sk: Vyhnutie sa možnému pádu pri spustení v súvislosti s tým, ako sú načítavané zásuvné moduly

source: Smarter file saving behavior
ckb: پاشەکەوتکردنی پەڕگە بە شێوەیەکی زیرەکانەتر
sk: Inteligentnejšie správanie ukladania súborov

source: File saving fixes
ckb: چارەسەرکردنی پاشەکەوتکردنی پەڕگە
sk: Opravy ukladania súborov

source: Don't add temporary files to tab restore
ckb: پەڕگە کاتییەکان بۆ گەڕاندنەوەی تاب زیاد مەکە
sk: Nepridávať dočasné súbory do obnovenia kariet

source: Don't recreate deleted files when restoring session
ckb: پەڕگە ڕەشکراوەکان دروست مەکەوە کاتێک سێشن دەگەڕێنییەوە
sk: Znovu nevytvárať odstránené súbory pri obnovovaní relácie

source: Restore line wrap preference
ckb: گەڕاندنەوەی ڕێکخستنی کۆکردنەوەی دێڕ
sk: Obnovenie predvoľby zalamovania riadkov

source: Add accel tooltips
ckb: زیادکردنی توڵتیپسی ئەکسێل
sk: Pridanie popisu pre accel

source: Minor bug fixes
ckb: چارەسەرکردنی چەند کێشەیەکی چکۆڵە
sk: Opravy menších chýb

source: elementary, Inc.
ckb: کۆمپانیای ئێلەمێنتەری هاوپشک.

source: Edit code files
ckb: دەستکاریکردنی پەڕگەکانی کۆد
fr: Modifier des fichiers de code
nl: Bewerk bronbestanden
ru: Редактирование файлов с кодом
sk: Upravujte súbory so zdrojovými kódmi
sv: Redigera kodfiler
uk: Зміна файлів з кодом
zh_tw: 編輯程式碼檔案

source: Code Editor
ckb: دەستکاریکەری کۆد
fr: Éditeur de code
ru: Редактор кода
sk: Editor kódu
sv: Kodredigerare
uk: Редактор коду
zh_tw: Code 編輯器

source: New File
ckb: پەڕگەی نوێ
fr: Nouveau fichier
nl: Nieuw bestand
ru: Новый файл
sk: Nový súbor
sv: Ny fil
uk: Новий файл
zh_tw: 新增檔案

source: New Window
ckb: پەنجەرەی نوێ
fr: Nouvelle fenêtre
nl: Nieuw venster
ru: Новое окно
sk: Nové okno
sv: Nytt fönster
uk: Нове вікно
zh_tw: 新增視窗

source: Run Code as Administrator
ckb: کارپێکردنی کۆد وەکو ئەدمین
fr: Exécuter Code en tant qu'administrateur
nl: Voer code uit als beheerder
ru: Запуск Кода от имени администратора
sk: Spustiť Kód ako správca
sv: Kör Kod som administratör
uk: Запуск Коду з правами адміністратора
zh_tw: 以管理員模式執行程式碼

source: Authentication is required to run Code as Administrator
ckb: سەلماندنی ڕەسەنێتی پێویستە بۆ کارپێکردنی کۆد وەکو ئەدمین
fr: Une authentification est requise pour exécuter Code en tant qu'administrateur
nl: Authenticatie is vereist om Code als Administrator uit te voeren
ru: Для запуска Кода от имени администратора требуется аутентификация
sk: Pre spustenie aplikácie Kód s oprávneniami administrátora je potrebné overenie
sv: Autentisering krävs för att köra Kod som administratör
uk: Потрібна автентифікація для запуску Коду з правами адміністратора
zh_tw: 需要驗證才能以管理員模式執行程式碼

source: text;IDE;scratch;code;
fr: texte;EDI;scratch;code;
nl: tekst;IDE;scratch;code;
ru: text;IDE;scratch;code;текст;редактор;код;
sk: text;IDE;scratch;kód;program;programovanie;
sv: text;IDE;scratch;kod;
uk: текст;редактор;код;text;IDE;code;
zh_tw: text;IDE;scratch;code;程式碼;

source: The high-contrast style-scheme is replaced by an elementary version with improved contrast for line numbers
zh_tw: 將高對比風格方案改為 elementary 的版本，並改善行數對比

source: The terminal pane now follows Terminal app color-scheme setting
zh_tw: 終端機面板的配色方案設定值現在與終端機應用程式同步

source: It is now possible to disable syntax highlighting
zh_tw: 提供停用語法突顯的選項

source: Absence of Terminal or Gnome settings no longer causes a crash
zh_tw: 修正沒有《終端機》或 GNOME 設定值時會崩潰的問題

source: The terminal pane now handles the shell exiting gracefully
zh_tw: 終端機面板現在能正常處理 shell 退出的情況

source: The terminal pane now follows the current active project path on start or opening
zh_tw: 終端機面板現在在啟動或開啟時會進入目前作用中專案的路徑

source: It is no longer possible to open multiple PasteBin dialogs
zh_tw: 修正能夠開啟多個 Pastebin 對話框的問題

source: A cause of possible crashing by the sidebar on startup was fixed
zh_tw: 修正可能在會讓側邊欄在啟動時造成崩潰的一個問題

source: The tooltips for C symbols are now more informative
nl: De tooltips voor C-symbolen zijn nu informatiever
sv: Verktygstipsen för C-symboler är nu mer informativa
zh_tw: 在 C 語言符號的工具提示裡提供更多資訊

source: Cloning success is now indicated by toast instead of a dialog
nl: Succesvol klonen wordt nu aangegeven met een melding in plaats van een dialoogvenster
sv: Lyckade kloningar indikeras nu av en skål istället för en dialog
zh_tw: 用 toast 而非對話框來顯示拓製成功

source: Global search and local search now have the same case sensitivity
nl: Algemene en lokale zoekopdrachten hebben nu dezelfde hoofdlettergevoeligheid
sv: Global sökning och lokal sökning har nu samma skiftlägeskänslighet
zh_tw: 讓專案內搜尋和檔案內搜尋使用相同的區分大小寫設定

source: Opening a second window no longer results in duplicate project entries in the project chooser
nl: Een tweede venster openen leidt niet langer tot dubbele projectvermeldingen in de projectkiezer
sv: Öppna ett andra fönster resulterar inte längre i dubbla projektposter i projektväljaren
zh_tw: 修正開啟第二個視窗會使專案在專案挑選器當中重複出現的問題

source: The terminal pane is now synchronized with the Terminal app foreground, background and palette settings
fr: Le panneau du terminal est désormais synchronisé avec les paramètres de couleur de l'application Terminal
nl: Het terminalvenster is nu gesynchroniseerd met de voorgrond-, achtergrond- en paletinstellingen van de Terminal-app
ru: Параметры панели терминала теперь синхронизируются с настройками приложения «Терминал»
sv: Terminalfönstret är nu synkroniserat med Terminal-appens inställningar för förgrund, bakgrund och palett
zh_tw: 終端機面板的前景、背景和調色盤設定值現在與終端機應用程式同步

source: The terminal pane is now synchronized with GNOME font and cursor blink settings
fr: Le panneau du terminal est désormais synchronisé avec les paramètres de police et du curseur de GNOME
nl: Het terminalvenster is nu gesynchroniseerd met GNOME's lettertype- en cursorknipperinstellingen
ru: Панель терминала теперь использует шрифт и параметры мерцания курсора из GNOME
sv: Terminalfönstret är nu synkroniserat med GNOME:s inställningar för teckensnitt och markörblinkning
zh_tw: 終端機面板的字型與游標閃爍設定值現在與 GNOME 的設定值同步

source: The Project Chooser context menu now includes an option to clone a remote git repository
fr: Le menu contextuel du sélecteur de projet comprend désormais une option pour cloner un dépôt git distant
nl: Het contextmenu van de Projectkiezer heeft nu de mogelijkheid een externe git-repositorie te klonen
ru: Контекстное меню выбора проекта теперь включает опцию клонирования удалённого git-репозитория
sv: Kontextmenyn Projektväljare innehåller nu ett alternativ för att klona ett fjärranslutet git-arkiv
uk: Контекстне меню вибору проєкту відтепер містить опцію клонування віддаленого git-репозиторію
zh_tw: 新增拓製遠端 Git 版本庫的選項到專案挑選器內文選單

source: The "Open Folder" action now appears in the Project Chooser context menu
fr: L'action « Ouvrir le dossier » apparaît désormais dans le menu contextuel du sélecteur de projet
nl: De actie "Open Map" verschijnt nu in het contextmenu van de Projectkiezer
ru: Опция «Открыть папку» теперь присутствует в контекстном меню выбора проекта
sv: Åtgärden "Öppna mapp" visas nu i snabbmenyn för projektväljaren
uk: Дія «Відкрити теку» відтепер з'являється в контекстному меню Обирача проєктів
zh_tw: 將「開啟資料夾」動作移動到專案挑選器內文選單

source: The Vala symbol pane now shows a spinner while loading
fr: Le panneau des symboles Vala affiche désormais un indicateur de chargement
nl: Het Vala-symboolvenster toont een laadpictogram tijdens het laden
ru: Панель символов Vala теперь отображает спиннер во время загрузки
sv: Vala-symbolfönstret visar nu en snurra under laddning
uk: На панелі символів Vala відтепер показується дзиґа під час завантаження
zh_tw: Vala 符號面板在載入中的時候現在會顯示旋轉圖示

source: The filter in the C symbol pane now works
fr: Le filtre fonctionne désormais dans panneau de symbole C
nl: Het filter in het C-symboolvenster werkt nu
ru: Фильтрация в панели символов C теперь работает
sv: Filtret i C-symbolfönstret fungerar nu
uk: Фільтр на панелі символів C тепер працює
zh_tw: 修正 C 符號面板的過濾器無法正常運作的問題

source: A new gutter is added for adding/removing edit marks that can be navigated between with keyboard shortcuts
fr: Une nouvelle bande est ajoutée pour ajouter/supprimer des marques d'édition entre lesquelles il est possible de naviguer à l'aide de raccourcis clavier
nl: Er is een nieuwe balk toegevoegd voor het toevoegen/verwijderen van bewerkingsmarkeringen, waartussen met sneltoetsen kan worden genavigeerd
ru: Новый раздел для меток редактирования, между которыми можно перемещаться с помощью сочетаний клавиш
sv: En ny ränna har lagts till för att lägga till/ta bort redigeringsmarkeringar som kan navigeras mellan med kortkommandon
uk: Додано новий лоток для додавання/видалення міток редагування, між якими можна переміщатися за допомогою комбінацій клавіш
zh_tw: 新增用來加入/移除編輯標記的標示區域，這些標記可以用鍵盤快捷鍵瀏覽

source: Remote branches may now be opened from the "Branch" menu
fr: Les branches distantes peuvent désormais être ouvertes depuis le menu « Branche »
nl: Externe branche kunnen nu geopend worden vanuit het "Branch"-menu
ru: Удалённые ветки теперь могут быть открыты из меню «Ветки»
sv: Fjärrgrenar kan nu öppnas från menyn "Gren"
uk: Віддалені гілки тепер можна відкривати з меню «Гілка»
zh_tw: 新增從「分支」選單開啟遠端分支的功能
