Repository: elementary/code
Catalog: po/extra/*.po
Languages: ckb, fr, nl, ro, ru, sk, sv, uk, zh_tw

source: Both Find on Page and Find in Project are now available from the app's menu instead of in the headerbar
fr: Les fonctions « Rechercher sur la page » et « Rechercher dans le projet » sont désormais disponibles dans le menu de l'application et non plus dans la barre de titre
nl: Zowel Zoeken op Pagina als Zoeken in Project zijn nu beschikbaar in het menu van de app in plaats van de kopbalk
ru: «Найти на странице» и «Найти в проекте» теперь доступны из меню приложения, а не в заголовке
sv: Både Hitta på sidan och Hitta i projektet är nu tillgängliga från appens meny i stället för i rubrikfältet
uk: Функції «Знайти на сторінці» та «Знайти в проєкті» відтепер доступні з меню застосунку, а не з панелі заголовка
zh_tw: 將「在頁面上尋找」和「在專案中尋找」從標頭列移到應用程式選單中

source: Options for hiding and showing panels are now all present in a compact set of linked buttons in the app's menu
fr: Les options permettant de masquer et d'afficher les panneaux sont désormais toutes présentes dans un ensemble compact de boutons liés dans le menu de l'application
nl: Opties voor het verbergen en tonen van panelen zijn nu aanwezig in een compacte set gekoppelde knoppen in het menu van de app
ru: Опции для скрытия и показа панелей теперь представлены в компактном списке связанных кнопок в меню приложения
sv: Alla alternativ för att dölja och visa paneler finns nu samlade i en kompakt uppsättning länkade knappar i appens meny
uk: Опції приховування та показу панелей відтепер представлені у вигляді компактного набору пов'язаних кнопок у меню застосунку
zh_tw: 將顯示/隱藏面板的各按鈕全部整理成應用程式選單裡的相連按鈕

source: The sidebar now contains the project chooser button and fills the height of the window
fr: La barre latérale contient désormais le bouton de sélection des projets et occupe toute la hauteur de la fenêtre
nl: De zijbalk bevat nu de knop voor het kiezen van projecten en vult de hoogte van het venster
ru: Боковая панель теперь содержит кнопку выбора проекта и занимает всю высоту окна
sv: Sidofältet innehåller nu projektväljarknappen och fyller fönstrets höjd
uk: Бічна панель відтепер містить кнопку вибору проєкту та заповнює всю висоту вікна
zh_tw: 將專案挑選按鈕加入側邊欄中，並讓側邊欄填滿視窗高度

source: Starting a global search with text selected now pre-fills that text
fr: Le lancement d'une recherche globale avec du texte sélectionné pré-remplit désormais le champ
nl: Bij een algemene zoekopdracht met geselecteerde tekst, wordt die tekst nu automatisch ingevuld
ru: Если при начале глобального поиска был выбран текст, то теперь он будет уже введён
sv: När du startar en global sökning med markerad text fylls texten nu i förväg
uk: Початок глобального пошуку з виділеним текстом, який тепер попередньо заповнює цей текст
zh_tw: 進行全域搜尋時如果有選擇文字，讓該文字變成搜尋的文字

source: The symbol outline pane is now shown to the right of the source view and can be shown and hidden with the keyboard shortcut "Alt + \"
fr: Le volet de détecteur de symboles est désormais affiché à droite de la vue du code source et peut être affiché et masqué à l'aide du raccourci clavier « Alt + \ »
nl: Het symbooloverzichtsvenster is nu zichtbaar aan de rechterkant van de bronweergave en kan getoond of verborgen worden met de sneltoets "Alt + \"
ru: Панель обводки символов тепеоь находится справа и можен быть открыта и закрыта с помощью сочетания клавиш «Alt + \»
sv: Panelen för symbolöversikt visas nu till höger om källvyn och kan visas och döljas med kortkommandot "Alt + \"
uk: Панель контуру символу відтепер показана праворуч від початкового вигляду і може бути показана і схована комбінацією клавіш «Alt + \»
zh_tw: 符號大綱面板現在顯示在程式碼檢視的右邊，並且可使用 "Alt + \" 快捷鍵來顯示或隱藏

source: Terminal, Symbol outline, and the Strip Trailing Whitespace plugins are now part of the main codebase
fr: Les modules terminal, détecteur de symboles et suppression des espaces blancs de fin de ligne font désormais partie intégrante de l'application
nl: De plug-ins Terminal, Symboolweergave en Verwijder blanco spaties, zijn nu onderdeel van de hoofdcodebasis
ru: Терминал, обводка символов и убирание пробелов в конце строк теперь входят в основной код приложения
sv: Tilläggen Terminal, Symbolöversikt och Avlägsna efterföljande blanksteg är nu en del av huvudkodbasen
uk: Плагіни Terminal, Symbol outline та Strip Trailing Whitespace стали частиною основної кодової бази
zh_tw: 將終端機、符號大綱、刪除行尾空白三個插件的程式碼併入主程式碼版本庫中

source: Show an infobar when tab width settings are being overwritten by an EditorConfig file
fr: Affichage d'une barre d'information lorsque les paramètres de largeur de tabulation sont écrasés par un fichier EditorConfig
nl: Toon een infobalk wanneer de instellingen voor de tabbreedte worden overschreven door een EditorConfig-bestand
ru: Показывать сообщение, когда ширина табуляции предопределена файлом EditorConfig
sv: Visa ett infofält när inställningarna för flikbredd skrivs över av en EditorConfig-fil
uk: Показ інфопанелі під час перезапису налаштувань ширини вкладки файлом EditorConfig
zh_tw: Tab 字元寬度被 EditorConfig 設定檔案覆寫時顯示資訊列來提醒

source: The shortcut for rebuilding the completion word list is now "Ctrl + |"
fr: Le raccourci pour reconstituer la liste d'autocomplétion est désormais « Ctrl + | »
nl: De sneltoets voor het opnieuw opstellen van de lijst met woordsuggesties is nu "Ctrl + |"
ru: Сочетание клавиш для перезагрузки списка слов теперь «Ctrl + |»
sv: Genvägen för att återuppbygga listan med kompletteringsord är nu "Ctrl + |"
uk: Відтепер «Ctrl + |» — це комбінація клавіш для перебудови списку слів доповнення
zh_tw: 更新單字補完的單字列表的快捷鍵現在改為 "Ctrl + |"

source: Edit text files
ro: Editează fișierul text

source: About Scratch
ro: Despre Scratch

source: The text editor that works
ro: Editor de text ce funcționează

source: Scratch is the text editor that works for you. It auto-saves your files, meaning they're always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.
ro: Scratch este editorul de text care lucreaza pentru tine. Auto-salvează fișierele, ceea ce înseamnă că sunt mereu actualizate. In plus, reține fișierele astfel încât să nu le pierzi, chiar și între sesiuni.

source: Make it yours. Scratch is written from the ground up to be extensible. Keep things super lightweight and simple, or install extensions to turn Scratch into a full-blown IDE; it's your choice. And with a handful of useful preferences, you can tweak the behavior and interface to your liking.
ro: Fă-l să fie al tau. Scratch este scris de la baza pentru a fi extensibil. Păstrează lucrurile ușor și simplu, sau instalează extensii pentru a transforma Scratch într-un IDE complex; e alegerea ta. Și, cu o serie de preferințe utile, poți personaliza comportamentul și interfața pe placul tău.

source: It's elementary. Scratch is made to be the perfect text editor for elementary, meaning it closely follows the high standards of design, speed, and consistency. It's sexy, but not distracting.
ro: Este elementar. Scratch este facut pentru a fi un editor text perfect pentru elementary, ceea ce înseamnă că urmărește îndeaproape standardele ridicate de proiectare, viteză și consistență. Este sexi, dar nu distrage atenția.

source: Works with your language. Whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Scratch has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
ro: Funcționează cu limba ta. Fie că programezi cod în Vala, script PHP, sau marchezi lucruri în HTML, Scratch te susține. Experimentează evidențierea sintaxei completă cu aproape toate limbajele de programare, scriptare și limbaje de marcare.

source: Other syntax-highlighted languages: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
ro: Alte sintaxe evidențiate in limbajele: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.

source: Additional features include:
ro: Caracteristicile suplimentare includ:

source: syntax highlighting with gtksourceview-3
ro: evidențierea sintaxei cu gtksourceview-3

source: a find bar to search the words in the files
ro: bară de căutare pentru a căuta cuvintele in fișiere

source: tab and split documents system
ro: sistem de file și divizarea documentelor

source: lots of others
ro: multe altele
