Repository: elementary/code
Catalog: po/extra/*.po
Languages: ckb, fr, nl, ro, ru, sk, sv, uk, zh_tw

source: Code
ckb: كۆد
ru: Код
sk: Kód
sv: Kod
uk: Код

source: The editor that works for you
ckb: ئەو دەستکاریکەرەی کە بۆ تۆ کار دەکات
fr: L'éditeur qui travaille pour vous
nl: De tekstverwerker die het werk voor jou doet
ru: Редактор, который работает для вас
sk: Editor, ktorý pracuje pre vás
sv: Redigeraren som arbetar åt dig
uk: Редактор, який працює для вас
zh_tw: 為您而生的編輯器

source: Whether you're writing in Markdown or managing a complex app codebase, Code is the lightweight but full-featured editor for you. It auto-saves your files to ensure they're always up-to-date, and it remembers your tabs so you never lose your spot—even between sessions.
ckb: تۆ ئەم ئەپە بۆ نووسینێکی سادە بەکار بهێنیت یان پڕۆگرامینگی پڕۆژەیەکی گەورەی پێ بکەیت، ئەوا هیچ کێشەت بۆ دروست نابێت. کۆد ئەپێکی زۆر سادە و سوکەڵەیە بەڵام پڕە لە تایبتەمەندی. خۆکارە پەڕگەکانت پاشەکەوت دەکات ( Auto-save) و تابەکان لە یاد نەکات کە کردبووتنەوە، تەنانەت ئەگەر سێشنیش کۆتایی پێ بهێنیت.
fr: Que vous écriviez en Markdown ou que vous gériez le code d'une application complexe, Code est l'éditeur léger mais complet qu'il vous faut. Il enregistre automatiquement vos fichiers pour qu'ils soient toujours à jour et mémorise vos onglets pour que vous ne vous perdiez jamais, même entre deux sessions.
nl: Of je nou in Markdown schrijft of een complexe codebase beheert, Code is een lichtgewicht maar volwaardige teksteditor. Het slaat automatisch je bestanden op zodat je altijd up-to-date bent, en het herinnert je tabbladen zodat je nooit je plaats verliest—zelfs tussen sessies in.
ru: Пишете ли вы используя Markdown или редактируете код сложного проекта, Код — это лёгкий, но полнофункциональный редактор. Он автоматически сохраняет ваши файлы и запоминает открытые вкладки. Вы никогда не потеряете место, на котором остановились, даже в перерывах между сессиями.
sk: Či už píšete v Markdown alebo spravujete komplexnú aplikačnú databázu, Kód je nenáročný, ale plne funkčný editor pre vás. Automaticky ukladá vaše súbory, aby boli vždy aktuálne. Pamätá si tiež otvorené karty, aby ste sa nikdy nestratili, dokonca ani pri prepínaní niekoľkých relácií.
sv: Oavsett om du skriver i Markdown eller hanterar en komplex appkodbas är Kod den lätta men fullt utrustade redigeraren för dig. Den sparar dina filer automatiskt så att de alltid är uppdaterade, och den kommer ihåg dina flikar så att du aldrig tappar bort din plats - inte ens mellan sessioner.
uk: Незалежно від того, чи пишете ви в Markdown або керуєте складною кодовою базою застосунків, Код — це легкий, але повнофункціональний редактор для вас. Він автоматично зберігає ваші файли, щоб вони завжди були актуальними й запам'ятовує ваші вкладки, щоб ви ніколи не втратите місце, на якому зупинилися, навіть в перервах між сеансами.
zh_tw: 不論您是在撰寫簡單 Markdown 文件還是要管理應用程式複雜的原始碼，Code 都能符合您的需求。Code 是一個輕量化但功能完善的編輯器，它會自動儲存您的檔案來確保它們總是與檔案系統維持同步，也會記住您的分頁讓您即使離開之後再回來也不會忘記自己上次在哪裡。

source: Designed around a project-based workflow, Code knows about your separate codebases. It comes with helpful Git integration to create and switch between branches and show changed files and lines within your projects.
ckb: کۆد، لەسەر بنەمای پڕۆژە دیزاین کراوە. ئەم ئەپە دەزانێت کە دەکرێت تۆ بنکەکۆدی جیاوازت هەبن. یەکێکی تر لە تایبەتمەندییەکانی بریتییە لە گیت بۆ دروستکردنی و هاتووچۆکردن لە نێوان بڕانچەکاندا، هەروەها دێر و پەڕگە دەستکاریکراوەکانت لەناو پڕۆژەکەتدا پشان دەدات.
fr: Conçu pour fonctionner par projet, Code reconnaît vos bases de code distinctes. Il est livré avec une intégration Git utile pour créer et passer d'une branche à l'autre et afficher les fichiers et lignes modifiés dans vos projets.
nl: Ontworpen rondom een project gebaseerde workflow, Code is bekkend met je verschillende codebases. Het komt met behulpzame Git-integratie om Git-takken aan te maken, te schakelen tussen takken en om veranderingen in bestanden en individuele lijnen te tonen binnen u projecten.
ru: Разработан для работы с различными проектами, Код знает о ваших отдельных кодовых базах. Он поставляется с интеграцией Git для создания и переключения между ветками, а также для отображения изменённых файлов и строк в ваших проектах.
sk: Navrhnutý okolo projektového spôsobu práce, Kód vie o vašich oddelených zdrojových kódoch. Prichádza s nápomocným napojením na Git pre vytváranie a prepínanie medzi vetvami a zobrazovanie zmien v súboroch a riadkoch v rámci vašich projektov.
sv: Kod är utformat kring ett projektbaserat arbetsflöde och känner till dina separata kodbaser. Den levereras med en användbar Git-integration för att skapa och växla mellan grenar och visa ändrade filer och rader inom dina projekt.
uk: Розроблений для роботи з різними проєктами, Код знає про ваші окремі кодові бази. Він поставляється з інтеграцією Git для створення та перемикання між гілками та показу змінених файлів та рядків у ваших проєктах.
zh_tw: Code 的工作流程以專案為單位，瞭解您各個分開來的程式庫。它提供有用的 Git 整合，讓您建立或切換分支，並在專案中顯示已變更的檔案與行。

source: Work with your language: whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Code has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
ckb: بەو زمانە بنووسە کە خۆت دەتەوێت: گرنگ نییە کە تۆ کار بە ڤالا بکەیت، یان خەریکی نووسینی سکریپت بیت بە PHP یان پێشەوەی وێبێک دابڕێژیت بە HTML، کۆد خەمی لێت خواردووە، بەنزیکەیی پاڵپشتی سینتاکسی تەواوی زمانەکانی بەرنامەنووسین، سکریپکردن و مارکەپ کردن دەکات و یەرمەتی هایلایتینگ دەدات.
fr: Il fonctionne avec votre langage. Que vous élaboriez du code en Vala, des scripts PHP, ou des pages HTML, Code est là pour vous. Profitez d’une coloration syntaxique complète avec presque tous les langages de programmation, des scripts ou de balisage.
nl: Werkt met uw taal: Of u nu in Vala code schrijft, een script maakt in PHP of opmaak bouwt in HTML, Code is er voor u. Benut volledige syntax-markering met bijna alle programmeer-, script-, en markuptalen.
ru: Работайте со своим языком: создаёте ли вы код на Vala, пишите скрипты на PHP или делаете разметку на HTML, Код поможет вам. Вы можете воспользоваться полной подсветкой синтаксиса почти во всех языках программирования, скриптов и разметки.
sk: Pracujte s vaším jazykom: či už zostrojujete kód vo Vale, skriptujete s PHP alebo pracujete v HTML, Kód je tu pre vás. Určite oceníte úplné zvýrazňovanie syntaxe s takmer všetkými programovacími, skriptovacími a značkovacími jazykmi.
sv: Arbeta med ditt språk: oavsett om du skapar kod i Vala, skriptar med PHP eller markerar saker i HTML, så har Kod allt du behöver. Upplev fullständig syntaxmarkering med nästan alla programmerings-, skript- och markeringsspråk.
uk: Працюйте зі своєю мовою: чи пишете ви код на Vala, чи скрипти на PHP або робите щось з HTML, Код прикриє вас. Підсвічування синтаксису багатьох мов програмування, скриптів і розмітки.
zh_tw: 配合您所使用的語言：不論您是在寫 Vala 程式、PHP 的指令稿、還是在編輯 HTML 標記，Code 都能符合您的需求。Code 為幾乎所有程式語言、指令稿語言與標記語言提供完整的語法突顯。

source: Find anything in your current file, specific folders, or your whole project with options for case-sensitivity and regular expressions.
ckb: بۆ هەر چییەک دەگەڕێت بگەڕێ لەناو پەڕگە کراوەکەی ئێستاتدا، یان لە ناو تەواوی پڕۆژەکەتدا بە بەکارهێنانی بژاردەکانی هەستیارەکەیس (case-sensitivity) و دەستەواژە باوەکان.
fr: Trouvez n'importe quoi dans votre fichier actuel, dans des dossiers spécifiques ou dans l'ensemble de votre projet grâce aux options de sensibilité à la casse et aux expressions régulières.
nl: Vind alles in u huidige bestand, specifieke folders, of u hele project met opties voor hoofdlettergevoeligheid en reguliere uitdrukkingen.
ru: Находите всё что угодно в текущем файле, определённых папках, или целом проекте с опцией выбора регистра и регулярных выражений.
sk: Nájdite čokoľvek v práve otvorenom súbore, v konkrétnych priečinkoch alebo v celom projekte s možnosťami pre rozlišovanie medzi malými a veľkými písmenami a bežnými výrazmi.
sv: Hitta vad som helst i den aktuella filen, i specifika mappar eller i hela projektet med alternativ för skiftlägeskänslighet och reguljära uttryck.
uk: Пошук у поточному файлі, конкретних теках або у всьому проєкті будь-чого з параметрами регістрозалежності та регулярних виразів.
zh_tw: 在目前檔案、指定資料夾，或是整個專案中尋找任何內容，並可設定是否要區分大小寫或是使用正則表達式。

source: Smart features throughout: automatic indentation, smart cut/copy behavior, visible whitespace for selected text and at the end of lines by default, and optional extensions for Markdown actions, spell checking, whitespace trimming, word completion, and more.
ckb: تایبەتمەندیە زیرەکەکان: بۆشایی خۆکاری سەرەتای دێڕ، ڕەفتاری زیرەکی بڕین/لەبەرگرتنەوە، بۆشایی سپی بینراو بۆ دەقی هەڵبژێردراو و لە کۆتایی هێڵەکان بە شێوەی سەرەکی، و پێوەکراوی ئارەزوومەندانە بۆ کردارەکانی مارکداون، هەڵەچنی، کورتکردنەوەی بۆشایی سپی، تەواوکردنی ووشەکان، و زیاتر.
fr: De nombreuses fonctionnalités intelligentes : indentation automatique, comportement intelligent en matière de couper/copier, espaces blancs visibles pour le texte sélectionné et à la fin des lignes par défaut, et extensions disponibles en option pour les actions Markdown, la vérification orthographique, le découpage des espaces blancs, l'auto-complétion, et plus encore.
nl: Alle slimme functies: automatisch inspringen, slim knip-/kopieergedrag, standaard zichtbare witruimte voor geselecteerde tekst en aan het eind van regels, en optionele uitbreidingen voor Markdown-acties, spellingcontrole, witruimte bijsnijden, woordaanvulling en meer.
ru: Умные функции: автоматический отступ, умное вырезание/копирование, отображение пробелов выбранного текста и в конце строк по умолчанию, а также дополнительные расширения для работы с Markdown, проверка орфографии, обрезка пробельных символов, завершения слов и многое другое.
sk: Inteligentné funkcie skrz na skrz: automatické odsadzovanie, inteligentné správanie vystrihovania/kopírovania, prepínanie viditeľnosti prázdnych znakov pre označený text a na konci riadkov a voliteľné rozšírenia pre Markdown akcie, kontrolu preklepov, orezávanie prázdnych znakov, dokončovanie slov a viac.
sv: Genomgående smarta funktioner: automatisk indragning, smart klipp-/kopieringsbeteende, synligt blanksteg för markerad text och i slutet av rader som standard, och valfria tillägg för Markdown-åtgärder, stavningskontroll, trimning av blanksteg, ordkomplettering med mera.
uk: Розумні функції: автовідступ, поведінка розумного копіювання/вирізання, показ пробілів вибраного тексту та в кінці рядків прямо з коробки та додаткові розширення для роботи з Markdown, перевірки правопису, обтинання пробілів, автозавершення слів та багато іншого.
zh_tw: Code 提供許多智慧功能：自動縮排、智慧剪下/複製行為、預設顯示所選文字與行尾空白字元，並提供可選的擴充元件來支援 Markdown 相關的動作、拼字檢查、刪除不必要的空白、單字補完等等。

source: Adapt Code to your workflow: you can tweak the behavior and interface as needed with a handful of useful and well-considered extensions and preferences.
ckb: کۆد بۆ ژینگەی کارەکەت بگونجێنە: دەتوانیت بە ئارەزووی خۆت دەستکاری ڕەفتار و ڕووکاری کۆد بکەیت لە ڕێکخستنەکان و زیادکراوە سوودبەخشەکان.
fr: Adaptez Code à votre flux de travail : vous pouvez modifier le comportement et l'interface selon vos besoins grâce à une poignée d'extensions et de préférences utiles et bien pensées.
nl: Code aanpassen aan uw workflow: u kunt het gedrag en de interface naar wens aanpassen met een handvol nuttige en goed doordachte uitbreidingen en voorkeuren.
ru: Приспособьте Код к своему рабочему процессу: при необходимости можно настроить поведение и интерфейс с помощью нескольких полезных и хорошо продуманных расширений и настроек.
sk: Upravte si Kód podľa štýlu vašej práce: môžete si upraviť správanie a vzhľad rozhrania podľa potreby pomocou množstva užitočných a premyslených rozšírení a predvolieb.
sv: Anpassa Kod till ditt arbetsflöde: du kan justera beteendet och gränssnittet efter behov med en handfull användbara och väl genomtänkta tillägg och inställningar.
uk: Пристосуйте код до свого робочого процесу: за необхідності можна налаштувати поведінку та інтерфейс за допомогою кількох корисних та добре продуманих розширень та налаштувань.
zh_tw: 調整 Code 讓它符合您的習慣：您可以隨需要利用一些細心設計的擴充元件與偏好設定來調整 Code 的行為和介面。

source: There's a ton more:
ckb: یەک تەن تایبەتمەندی تر ماوە:
fr: Et bien plus encore :
nl: Er is nog veel meer:
ru: И ещё много чего:
sk: A je toho omnoho viac:
sv: Det finns massor mer:
uk: А також:
zh_tw: 還有更多：

source: Solarized Light, Solarized Dark, and High Contrast color schemes that affect the whole UI
ckb: ڕووکاری ڕەنگ هەتاوی، و تاریک و سکیمەکانی ڕەنگی کۆنتراست بەرز کە تەواوی دیزاینی ئەپەکە دەگرێتەوە
fr: Thèmes de couleurs Solarized Light, Solarized Dark et Contraste élevé qui affectent l'ensemble de l'interface utilisateur
nl: Solarized Light, Solarized Dark en High Contrast kleurenschema's die de hele gebruikersinterface beïnvloeden
ru: Цветовые схемы Solarized Light, Solarized Dark и High Contrast, которые влияют на весь интерфейс
sk: Schémy farieb Solarizovaná svetlá, Solarizovaná tmavá a Vysoký kontrast, ktoré sa týkajú celého používateľského rozhrania
sv: Färgscheman för Solariserat ljus, Solariserat mörk och Hög kontrast som påverkar hela användargränssnittet
uk: Solarized світла, Solarized темна, а також висококонтрастна кольорові схеми, які впливають на весь інтерфейс
zh_tw: 提供影響整個介面的 Solarized Light、Solarized Dark 及高對比配色方案

source: Togglable sidebar to fit your workflow
ckb: سایدباڕێک کە دەتوانیت بیشاریتەوە یان وەکو خۆی بیهێڵییەوە، واتا ڕەوتکراوە
fr: Barre latérale amovible pour s'adapter à votre flux de travail
nl: Schakelbare zijbalk voor uw workflow
ru: Динамичная боковая панель подходящая вам
sk: Voliteľný bočný panel, ktorý zapadá do vášho spôsobu práce
sv: Växlingsbart sidofält för att passa ditt arbetsflöde
uk: Перемикання бічної панелі для зручності роботи
zh_tw: 側邊欄可切換是否顯示以符合您的習慣

source: Smart indentation and .editorconfig support
ckb: دانانی بۆشایی سەرەتای دێڕ بە شێوەیەکی زیرەکانە و پاڵپشتی کردنی .editorconfig
fr: Indentation intelligente et prise en charge des fichiers .editorconfig
nl: Slimme inspringing en ondersteuning voor .editorconfig
ru: Умный отступ и поддержка .editorconfig
sk: Inteligentné odsadzovanie a podpora štandardu .editorconfig
sv: Smart indragning och stöd för .editorconfig
uk: Розумні автовідступи та підтримка .editorconfig
zh_tw: 智慧縮排和 .editorconfig 支援

source: Browser-class tabs with drag-and-drop, duplication, undo closing, and tab history
ckb: تابەکان لەناو ئەم ئەپەدا، وەکو تابەکانی وێبگەڕ (بڕاوزەر) وایە، دەتوانیت ڕاکێشان بە تابەکان بکەیت یان بە دوویان بکەیت. هەر وەکو وێبگەڕ، دەتوانیت تابێكی داخراو دوبارە بگەڕێنییە یان سەیری مێژووی تابە کراوەکانت بکەیت
fr: Onglets comme dans un navigateur, avec glisser-déposer, duplication, annulation de la fermeture et historique des onglets
nl: Browser-klasse tabbladen met drag-and-drop, duplicatie, ongedaan maken van sluiten en tabbladgeschiedenis
ru: Вкладки браузерного качества с возможностью перетаскивания в другое окно, дублированием, отменой закрытия и историей вкладок
sk: Karty ako vo webovom prehliadači, ktoré je možné presúvať, duplikovať, znova zobraziť po zatvorení a prezrieť si ich históriu
sv: Flikar i webbläsarklass med dra-och-släpp, duplicering, ångra stängning och flikhistorik
uk: Вкладки, як у переглядачі з перетягуванням, дублюванням, скасуванням закриття й історією вкладки
zh_tw: 如同瀏覽器一般功能完善的分頁，支援拖放、建立副本、復原關閉以及分頁歷史

source: Display the current line and character—and quickly jump to a new line
ckb: پشاندانی کارێکتەر و دێڕی ئێستا و بەخێرای بازدان بۆ دێڕی تازە
fr: Affichage de la ligne et du caractère courants, et saut rapide à une nouvelle ligne
nl: De huidige regel en het huidige teken weergeven—en snel naar een nieuwe regel springen
ru: Отображает текущую строку и символ и быстро переходит к новой строке
sk: Zobrazte si aktuálny riadok a znak – a rýchlo preskočte na nový riadok
sv: Visa aktuell rad och tecken - och hoppa snabbt till en ny rad
uk: Знайдіть поточний рядок чи символ і швидко перейдіть до нового рядка
zh_tw: 顯示目前游標所在的行與欄——並快速跳到另一行

source: Scroll past the end of the file so you can keep the current line where it's comfortable
ckb: سکرۆڵکردن لە کۆتایی فایلەکە بۆ ئەوەی بتوانیت هێڵی ئێستا لەو شوێنەی کە ئاسوودەیە بهێڵیتەوە
fr: Faites défiler le fichier jusqu'à la fin pour garder la ligne en cours là où c'est confortable
nl: Scroll voorbij het einde van het bestand, zodat je de huidige regel op zijn plaats kunt houden
ru: Прокрутите файл до конца, чтобы сохранить текущую строку там, где это удобно
sk: Posúvajte sa až za koniec súboru, takže môžete ponechať aktuálny riadok v takej výške, v akej je to pohodlné
sv: Bläddra förbi slutet av filen så att du kan behålla den aktuella raden där den är bekväm
uk: Прокрутіть у кінець файлу, щоб зберегти поточний рядок там, де зручно
zh_tw: 捲動到超過檔案末端，讓您能把目前的行保持在讀起來舒適的位置

source: Optional mini-map to make navigating large files easier
ckb: نەخشۆچکەیەکی ئارەزوومەندانە بۆ ئاسانکردنی هاتووچۆکردن بەناو فایلە گەورەکان
fr: Mini-carte en option pour faciliter la navigation dans les gros fichiers
nl: Optionele mini-kaart om het navigeren door grote bestanden te vergemakkelijken
ru: Мини-карта для упрощения навигации по большим файлам
sk: Voliteľná minimapa, ktorá zjednodušuje pohyb po väčších súboroch
sv: Minikarta som tillval för att göra det enklare att navigera i stora filer
uk: Опційна міні-карта для полегшення навігації у великих файлах
zh_tw: 可關閉的小地圖，讓瀏覽大檔案變得更容易

source: Improvements:
ckb: پێشکەوتنەکان:
fr: Améliorations :
nl: Verbeteringen:
ru: Улучшения:
sk: Vylepšenia:
sv: Förbättringar:
uk: Удосконалення:
zh_tw: 改善：

source: Option to follow the system dark style preference
ckb: بژاردەیەک بۆ وەرگرتنی هەمان دۆخی سیستەم (تاریک و ڕووناک)
fr: Option pour suivre le thème du système
nl: Optie om het donkere thema van het systeem te volgen
ru: Опция для следования настройкам темной темы в системе
sk: Možnosť rešpektovať systémové nastavenie tmavého štýlu
sv: Möjlighet att följa systemets mörka stilinställning
uk: Опція дотримання темного стилю системи
zh_tw: 新增跟隨系統深色風格的選項

source: Fixes:
ckb: چاککردنەکان:
fr: Corrections :
nl: Opgelost:
ru: Исправления:
sk: Opravy:
sv: Åtgärdar:
uk: Виправлення:
zh_tw: 修正：

source: Drag and drop with text containing accented characters
ckb: ڕاکێشان و بەردانەوە بە دەقێک کە پیتی ئەکسێنتدی تێدایە
sk: Funkcia uchop a pusť pre text obsahujúci znaky s farebným odtieňom

source: Text duplication issues when dragging text between multiple windows
ckb: کێشەکانی بەدووکردنی دەق کاتێک دەقێک لە نێوان چەند پەنجەرەیەک ڕادەکێشیت
sk: Chyby duplikácie textu pri jeho presúvaní medzi viacerými oknami

source: Minor updates:
ckb: وردە نوێکارییەکان:
fr: Mises à jour mineures :
nl: Kleine updates:
ru: Незначительные обновления:
sk: Menšie aktualizácie:
sv: Mindre uppdateringar:
uk: Незначні оновлення:
zh_tw: 小型更新：

source: Updated translations
ckb: وەرگێڕانەکان نوێکراونەوە
fr: Mise à jour des traductions
nl: Bijgewerkte vertalingen
ru: Обновлены переводы
sk: Aktualizované preklady
sv: Uppdaterade översättningar
uk: Оновлено переклади
zh_tw: 更新翻譯

source: The current document filename is now shown as the window title in multitasking view
ckb: لە کاتی مەڵتی تاسکینگدا، ناوی پەڕگەی کراوە وەکو لە تایتڵی پەنجەرەدا دەردەکەوێت
fr: Le nom du document courant est désormais affiché comme titre de fenêtre dans la vue multitâche
nl: De huidige bestandsnaam van het document wordt nu getoond als de titel van het venster in de multitasking-weergave
ru: Название открытого документа теперь отображается как заголовок окна в режиме многозадачности
sk: Názov aktuálneho dokumentu sa teraz zobrazí ako názov okna v zobrazení úloh
sv: Filnamnet på det aktuella dokumentet visas nu som fönstertitel i multitaskingvyn
uk: Назва поточного файлу документів тепер показуватиметься назвою вікна у багатозадачному огляді
zh_tw: 在多工作業檢視中現在會將目前文件的檔案名稱顯示為視窗標題

source: Hidden folders are now shown in the project sidebar
ckb: بوخچە شاراوەکان لە سایدباڕی پڕۆژەکدا دەردەکەون
fr: Les dossiers cachés sont désormais affichés dans la barre latérale du projet
nl: Verborgen mappen worden nu getoond in de projectzijbalk
ru: Скрытые папки теперь показываются в боковой панели проекта
sk: Skryté priečinky sa teraz zobrazujú v bočnom paneli projektu
sv: Dolda mappar visas nu i sidofältet för projektet
uk: Сховані теки відтепер показуються на бічній панелі проєкту
zh_tw: 在專案側邊欄當中顯示隱藏檔案

source: The currently selected result and the number of results is displayed while searching
ckb: ئەنجامە دیاریکراوەکانی ئێستا و ژمارەی ئەنجامەکان پیشان دەدرێن لەکاتی گەڕان
fr: Le résultat sélectionné et le nombre de résultats est affiché lors de la recherche
nl: Het huidige geselecteerde resultaat en het aantal resultaten wordt weergegeven tijdens het zoeken
ru: Выбранный результат и общее количество результатов отображаются во время поиска
sk: Práve zvolený výsledok a počet výsledkov sa zobrazia počas vyhľadávania
sv: Det aktuella resultatet och antalet resultat visas under sökningen
uk: Під час пошуку показується поточний вибраний результат і кількість результатів
zh_tw: 搜尋時顯示目前所選的結果與結果總數

source: The search bar now has a regular expression mode
ckb: شریتی گەڕان ئێستا دۆخی دەربڕینی ئاسایی هەیە
fr: La barre de recherche possède désormais un mode expression régulière
nl: De zoekbalk heeft nu een modus voor reguliere uitdrukkingen
ru: Панель поиска теперь имеет режим регулярных выражений
sk: Panel vyhľadávania teraz podporuje režim regulárneho výrazu
sv: Sökfältet har nu ett läge för reguljära uttryck
uk: Панель пошуку тепер має режим регулярних виразів
zh_tw: 為搜尋列加入正則表達式模式

source: It is now possible to change Git branch with untracked files present in a project
ckb: ئێستا دەتوانرێ برانچی گیت بگۆڕیت لەگەڵ فایلە نەدۆزراوەکان کە لە پرۆژەکەدا هەیە
fr: Il est désormais possible de changer de branche Git lorsque des fichiers non suivi sont présent dans un projet
nl: Het is nu mogelijk om Git-branch te wijzigen met niet-getraceerde bestanden aanwezig in een project
ru: Стало возможным менять ветку Git c неотслеживаемыми файлами в проекте
sk: Teraz je možné zmeniť vetvu Git s nesledovanými súbormi, ktoré sa nachádzajú v projekte
sv: Det är nu möjligt att ändra Git-gren med ospårade filer som finns i ett projekt
uk: Тепер можна змінити гілку Git з не відстежуваними файлами, присутніми в проєкті
zh_tw: 專案中即使有未追蹤的檔案現在也能變更 Git 分支

source: Crashes are prevented while searching in large projects
ckb: ڕێگری لە تێکچوونی کۆد کراوە لەکاتی گەڕان لە پڕۆژە گەورەکاندا
fr: Prévention des risques de plantage lors de la recherche dans des projets conséquents
nl: Crashes worden voorkomen bij het zoeken in grote projecten
ru: Исправлены вылеты при поиске в больших проектах
sk: Zabránenie pádov pri vyhľadávaní vo veľkých projektoch
sv: Krascher förhindras vid sökning i stora projekt
uk: Усунуто збої під час пошуку у великих проєктах
zh_tw: 防止在大型專案中搜尋時發生的崩潰

source: The correct document is now focused after opening Code from an external program
ckb: دۆکیومێنتە دروستەکە ئێستا سەرنجدراوە دوای کردنەوەی کۆد لە بەرنامەیەکی دەرەکی
fr: Le bon document est désormais sélectionné après l'ouverture de Code depuis un autre programme
nl: Het juiste document is nu gericht na het openen van Code vanuit een extern programma
ru: Теперь правильный документ находится в фокусе после открытия Кода из внешней программы
sk: Po otvorení aplikácie Kód z externého programu bude zameraný správny dokument
sv: Rätt dokument är nu fokuserat efter att Kod öppnats från ett externt program
uk: Тепер фокусування відбувається на правильному документі після відкриття коду із зовнішнього застосунку
zh_tw: 從外部程式開啟 Code 時聚焦正確的文件
