Repository: elementary/code
Catalog: po/plugins/*.po
Languages: be, cs, es, fr, ja, ka, nl, pl, ru, sk, uk

source: Brackets Completion
be: Закрыццё дужак
cs: Doplňování závorek
es: Compleción de signos de puntuación dobles
fr: Complétion de parenthèses et crochets
ja: ブラケット補完
ka: ფრჩხილების დასრულება
nl: Automatisch toevoegen van haakjes
pl: Uzupełnianie nawiasów
ru: Автозавершение скобок
sk: Dokončovanie zátvoriek
uk: Закривання дужок

source: Complete brackets while typing
be: Аўтаматычна закрываць дужкі пры друкаванні
cs: Doplňuje závorky v průběhu psaní
es: Completar comillas, paréntesis, corchetes y llaves mientras escribe
fr: Complète les parenthèses et les crochets pendant l'écriture
ja: 文字入力中にブラケットを補完します
ka: ფრჩხილების დასრულება კრეფისას
nl: Haakjes worden automatisch toegevoegd terwijl u typt
pl: Uzupełnia nawiasy podczas pisania
ru: Автозакрытие скобок во время набора
sk: Doplňuje zátvorky počas písania
uk: Закривати дужки під час набору тексту

source: Detect Indent
be: Выяўляць водступы
cs: Zjišťování odsazení
es: Detectar sangría
fr: Détecter l’indentation
ja: インデントを検知
ka: შეწევის აღმოჩენა
nl: Detecteer inspringen
pl: Wykrywanie wcięć
ru: Обнаружить отступы
sk: Detekcia odsadenia
uk: Виявлення відступів

source: Heuristically detect tab or space settings
be: Эўрыстычнае вызначэнне налад табуляцыі або прабелаў
cs: Heuristicky zjišťuje nastavení tabulátorů nebo mezer
es: Detección heurística de configuraciones de tabulación o espaciado
fr: Détection heuristique des paramètres de tabulation ou d'espacement
ja: タブやスペースの設定をヒューリスティックに検知します
ka: ტაბულაციის ან გამოტოვების პარამეტრების ევრისტიკული აღმოჩენა
nl: Detecteer automatisch tab of spatie gebruik
pl: Heurystyczne wykrywanie ustawień tabulacji i spacji
ru: Эвристическое обнаружение настроек табуляции или пробелов
sk: Heuristicky detekuje nastavenia tabulátorov či medzier
uk: Евристично визначити налаштування табуляції або пробілів

source: EditorConfig
pl: Konfiguracja edytora

source: Load settings from an EditorConfig file
be: Загружаць налады з файла EditorConfig
cs: Načte nastavení ze souboru EditorConfig
es: Cargar configuraciones desde un archivo EditorConfig
fr: Charger les paramètres d'un fichier EditorConfig
ja: EditorConfig ファイルから設定を読み込みます
ka: პარამეტრების ჩატვირთვა EditorConfig ფაილიდან
nl: Laad instelling vanuit een EditorConfig bestand
pl: Wczytaj ustawienia z pliku Konfiguracji edytora
ru: Загружать настройки из файла EditorConfig
sk: Načíta nastavenia zo súboru EditorConfig
uk: Завантаження налаштувань з файлу EditorConfig

source: Find Project Files
be: Пошук файлаў праекта
es: Buscar archivos en proyecto
fr: Rechercher dans les fichiers du projet
ja: プロジェクトファイルを検索
pl: Znajdź pliki projektu
ru: Поиск файлов проекта
uk: Пошук файлів проєкту

source: Fuzzy search for files in all open projects (Show using ALT + F)
be: Неакрэслены пошук файлаў ва ўсіх адкрытых праектах (Паказваецца праз ALT + F)
es: Búsqueda aproximada de archivos en todos los proyectos abiertos (desplegar con Alt + F)
fr: Recherche approximative de fichiers dans tous les projets ouverts (afficher en utilisant ALT + F)
ja: 開いているすべてのプロジェクトを対象にファイルをあいまい検索します (ALT + F で表示)
pl: Rozmyte wyszukiwanie we wszystkich otwartych projektach (Wywołaj przy użyciu ALT + F)
ru: Нечёткий поиск файлов во всех открытых проектах (ALT + F)
uk: Неточний пошук файлів у всіх відкритих проєктах (Показ натисканням ALT + F)

source: Highlight Word Selection
be: Падсвечваць вылучаныя словы
cs: Zvýraznění vybraného slova
es: Resaltar la palabra seleccionada
fr: Surligner le mot sélectionné
ja: 選択された単語をハイライト
ka: მონიშნული სიტყვების გამოკვეთა
nl: Highlight woord selectie
pl: Zakreślające zaznaczanie słów
ru: Подсвечивать выделение слов
sk: Zvýraznenie výberu slov
uk: Підсвічування виділення слів

source: Highlights all occurrences of words that are selected
be: Падсвечвае ўсе з'яўленні вылучаных слоў
cs: Zvýraznňuje všechny výskyty slov, která jsou vybrána
es: Resalta todas las apariciones de palabras seleccionadas
fr: Surligner toutes les occurrences des mots sélectionnés
ja: 選択された単語の出現をハイライトします
ka: სიტყვის, რომელიც მონიშნულია, ყველა გამოჩენას გამოკვეთს
nl: Highlight alle exemplaren van een geselecteerd woord
pl: Zakreśla wszystkie wystąpienia wyznaczonych słów
ru: Подсвечивать выделенное слово во всех местах
sk: Zvýrazňuje všetky výskyty slov, ktoré sú práve vybrané
uk: Виділяє всі збіги виділення слів

source: Markdown Actions
be: Дзеянні Markdown
cs: Akce pro Markdown
es: Acciones de Markdown
fr: Actions Markdown
ja: Markdown アクション
ka: მარკდაუნის ქმედებები
nl: Markdown Acties
pl: Czynności Markdown
ru: Действия Markdown
sk: Akcie Markdown
uk: Дії markdown

source: Adds keyboard shortcuts for quick editing Markdown files
be: Дадае спалучэнні клавіш для хуткай працы з файламі Markdown
cs: Přidá klávesové zkratky pro rychlé upravování Markdown souborů
es: Añade atajos de teclado para editar archivos Markdown rápidamente
fr: Ajout de raccourcis claviers pour modifier rapidement les fichiers Markdown
ja: Markdown ファイルをすばやく編集できるキーボードショートカットを追加します
ka: დაამატეთ კლავიატურის მალსახმობი მარკდაუნის ფაილების სწრაფად ჩასასწორებლად
nl: Voegt sneltoetsen toe voor snelbewerking van Markdown bestanden
pl: Dodaje skróty klawiszowe do szybkiego edytowania plików Markdown
ru: Добавляет сочетания клавиш для быстрого редактирования файлов Markdown
sk: Pridá klávesové skratky pre rýchlu úpravu súborov Markdown
uk: Додає комбінації клавіш для швидкого редагування файлів Markdown

source: Share files with pastebin service
be: Абагульвайце файлы з дапамогай сэрвісу pastebin
cs: Sdílejte soubory pomocí služby pastebin
es: Comparte archivos con el servicio pastebin
fr: Partager des fichiers avec le service Pastebin
ja: Pastebin サービスを利用してファイルを共有します
ka: გააზიარეთ ფაილები pastebin-ით
nl: Deel bestanden via de Pastebin service
pl: Współdziel pliki poprzez usługę pastebin
ru: Поделиться файлами с помощью Pastebin
sk: Zdieľajte súbory pomocou služby Pastebin
uk: Діліться файлами за допомогою служби pastebin

source: Preserve Indent
be: Захоўваць водступы
cs: Zachování odsazení
es: Mantener sangría
fr: Conserver l'indentation
ja: インデントを保持
ka: შეწევის სენარჩუნება
nl: Behoud inspringing
pl: Zapobieganie wcięciom
ru: Сохранять отступы
sk: Zachovanie odsadenia
uk: Збереження відступу

source: Maintains relative indent level of pasted text
be: Захоўвае адносныя водступы ўстаўленага тэксту
cs: Zachovává relativní odsazení u vloženého textu
es: Mantiene el nivel de sangría relativo del texto pegado
fr: Maintient le niveau relatif d'indentation du texte collé
ja: 貼り付けされたテキストの相対的なインデントレベルを維持します
ka: ჩასმული ტექსტის შედარებითი შეწევის შენარჩუნება
nl: Behoud de inspringing van een tekst bij het plakken
pl: Zachowuje względny poziom wcięcia wklejonego tekstu
ru: Сохраняет относительные отступы вставленного текста
sk: Zachováva relatívnu úroveň odsadenia vloženého textu
uk: Підтримує пов'язані відступи вставленого тексту

source: Spell Checker
be: Праверка правапісу
cs: Kontrola pravopisu
es: Corrector ortográfico
fr: Vérificateur orthographique
ja: スペルチェッカー
ka: მართლწერის შემოწმება
nl: Spellingscontrole
pl: Sprawdzanie pisowni
ru: Проверка орфографии
sk: Kontrola pravopisu
uk: Перевірка правопису

source: Checks the spelling of your documents
be: Правярае правапіс у вашых дакументах
cs: Kontroluje pravopis vašich dokumentů
es: Verifica la ortografía de sus documentos
fr: Vérifie l'orthographe de vos documents
ja: ドキュメントのスペルをチェックします
ka: თქვენი დოკუმენტების მართლწერის შემოწმება
nl: Controleer de spelling van uw documenten
pl: Sprawdzanie pisowni w Twoich dokumentach
ru: Проверяет правописание ваших документов
sk: Kontroluje pravopis vašich dokumentov
uk: Перевіряє правопис ваших документів

source: Vim Emulation
be: Эмуляцыя Vim
cs: Emulace editoru Vim
es: Emulación de Vim
fr: Émulation de Vim
ja: Vim エミュレーション
ka: Vim-ის ემულაცია
nl: Vim emulatie
pl: Emulacja Vim
ru: Эмуляция Vim
sk: Emulátor Vim
uk: Емуляція Vim

source: Use Vim commands in Code
cs: Používejte Vim příkazy v Code
es: Utilice comandos de Vim en Code
fr: Utiliser les commandes de Vim dans Code
ja: “コード”で Vim コマンドを使用します
ka: Vim-ის ბრძანებების გამოყენება Code-ში
nl: Gebruik Vim commandoâ€™s in Code
pl: Użyj poleceń Vim w programie Kod
ru: Использовать команды Vim
sk: Používajte príkazy Vim v aplikácii Kód
uk: Користуйтеся командами Vim у Коді

source: Words Completion
cs: Doplňování slov
es: Compleción de palabras
fr: Complétion automatique
ja: 単語補完
ka: სიტყვების დასრულება
nl: Woorden completeren
pl: Uzupełnianie słów
ru: Завершение слов
sk: Dokončovanie slov
uk: Завершення слів

source: Show a completion dialog with most used words from your files
cs: Zobrazte doplňovací dialog s nejčastěji používanými slovy z vašich souborů
es: Mostrar un diálogo de compleción con las palabras más usadas de sus archivos
fr: Affiche une invite avec les mots les plus utilisés dans vos fichiers
ja: ファイル内で最も使用された単語を補完するダイアログを表示します
ka: გაჩვენებთ დასრულების დიალოგს, რომელიც თქვენი ფაილებიდან ყველაზე ხშირად გამოყენებულ სიტყვებს შეიცავს
nl: Toon een completeer venster met de meest gebruikte woorden uit uw bestanden
pl: Wyświetla okno uzupełniania z najczęściej używanymi słowami z Twoich plików
ru: Показать диалоговое окно завершения с наиболее часто используемыми словами из файлов
sk: Zobrazte si dialóg doplňovania slov s najčastejšie používanými slovami z vašich súborov
uk: Показ діалогового вікна завершення з найвживанішими словами з ваших файлів
